/* automatically generated by rust-bindgen 0.61.0 */

#![allow(nonstandard_style, clippy::all)]

pub const MA_VERSION_MAJOR: u32 = 0;
pub const MA_VERSION_MINOR: u32 = 11;
pub const MA_VERSION_REVISION: u32 = 10;
pub const MA_SIZEOF_PTR: u32 = 8;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _CRT_HAS_C11: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;
pub const MA_TRUE: u32 = 1;
pub const MA_FALSE: u32 = 0;
pub const MA_SIZE_MAX: u32 = 4294967295;
pub const MA_SIMD_ALIGNMENT: u32 = 32;
pub const MA_MIN_CHANNELS: u32 = 1;
pub const MA_MAX_CHANNELS: u32 = 254;
pub const MA_MAX_FILTER_ORDER: u32 = 8;
pub const MA_MAX_LOG_CALLBACKS: u32 = 4;
pub const MA_CHANNEL_INDEX_NULL: u32 = 255;
pub const MA_DATA_FORMAT_FLAG_EXCLUSIVE_MODE: u32 = 2;
pub const MA_MAX_DEVICE_NAME_LENGTH: u32 = 255;
pub const MA_DATA_SOURCE_SELF_MANAGED_RANGE_AND_LOOP_POINT: u32 = 1;
pub const MA_RESOURCE_MANAGER_MAX_JOB_THREAD_COUNT: u32 = 64;
pub const MA_MAX_NODE_BUS_COUNT: u32 = 254;
pub const MA_MAX_NODE_LOCAL_BUS_COUNT: u32 = 2;
pub const MA_NODE_BUS_COUNT_UNKNOWN: u32 = 255;
pub const MA_ENGINE_MAX_LISTENERS: u32 = 4;
pub const MA_SOUND_SOURCE_CHANNEL_COUNT: u32 = 4294967295;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_data_public> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(__crt_locale_data_public),
        "::",
        stringify!(_locale_pctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(__crt_locale_data_public),
        "::",
        stringify!(_locale_mb_cur_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(__crt_locale_data_public),
        "::",
        stringify!(_locale_lc_codepage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_pointers> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(__crt_locale_pointers),
        "::",
        stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(__crt_locale_pointers),
        "::",
        stringify!(mbcinfo)
        )
    );
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    const UNINIT: ::std::mem::MaybeUninit<_Mbstatet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(_Mbstatet),
        "::",
        stringify!(_Wchar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(_Mbstatet),
        "::",
        stringify!(_Byte)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize },
        6usize,
        concat!(
        "Offset of field: ",
        stringify!(_Mbstatet),
        "::",
        stringify!(_State)
        )
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn __threadid() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __threadhandle() -> usize;
}
pub type ma_int8 = ::std::os::raw::c_schar;
pub type ma_uint8 = ::std::os::raw::c_uchar;
pub type ma_int16 = ::std::os::raw::c_short;
pub type ma_uint16 = ::std::os::raw::c_ushort;
pub type ma_int32 = ::std::os::raw::c_int;
pub type ma_uint32 = ::std::os::raw::c_uint;
pub type ma_int64 = ::std::os::raw::c_longlong;
pub type ma_uint64 = ::std::os::raw::c_ulonglong;
pub type ma_uintptr = ma_uint64;
pub type ma_bool8 = ma_uint8;
pub type ma_bool32 = ma_uint32;
pub type ma_handle = *mut ::std::os::raw::c_void;
pub type ma_ptr = *mut ::std::os::raw::c_void;
pub type ma_proc = ::std::option::Option<unsafe extern "C" fn()>;
pub const ma_log_level_MA_LOG_LEVEL_DEBUG: ma_log_level = 4;
pub const ma_log_level_MA_LOG_LEVEL_INFO: ma_log_level = 3;
pub const ma_log_level_MA_LOG_LEVEL_WARNING: ma_log_level = 2;
pub const ma_log_level_MA_LOG_LEVEL_ERROR: ma_log_level = 1;
pub type ma_log_level = ::std::os::raw::c_int;
pub type ma_channel = ma_uint8;
pub const _ma_channel_position_MA_CHANNEL_NONE: _ma_channel_position = 0;
pub const _ma_channel_position_MA_CHANNEL_MONO: _ma_channel_position = 1;
pub const _ma_channel_position_MA_CHANNEL_FRONT_LEFT: _ma_channel_position = 2;
pub const _ma_channel_position_MA_CHANNEL_FRONT_RIGHT: _ma_channel_position = 3;
pub const _ma_channel_position_MA_CHANNEL_FRONT_CENTER: _ma_channel_position = 4;
pub const _ma_channel_position_MA_CHANNEL_LFE: _ma_channel_position = 5;
pub const _ma_channel_position_MA_CHANNEL_BACK_LEFT: _ma_channel_position = 6;
pub const _ma_channel_position_MA_CHANNEL_BACK_RIGHT: _ma_channel_position = 7;
pub const _ma_channel_position_MA_CHANNEL_FRONT_LEFT_CENTER: _ma_channel_position = 8;
pub const _ma_channel_position_MA_CHANNEL_FRONT_RIGHT_CENTER: _ma_channel_position = 9;
pub const _ma_channel_position_MA_CHANNEL_BACK_CENTER: _ma_channel_position = 10;
pub const _ma_channel_position_MA_CHANNEL_SIDE_LEFT: _ma_channel_position = 11;
pub const _ma_channel_position_MA_CHANNEL_SIDE_RIGHT: _ma_channel_position = 12;
pub const _ma_channel_position_MA_CHANNEL_TOP_CENTER: _ma_channel_position = 13;
pub const _ma_channel_position_MA_CHANNEL_TOP_FRONT_LEFT: _ma_channel_position = 14;
pub const _ma_channel_position_MA_CHANNEL_TOP_FRONT_CENTER: _ma_channel_position = 15;
pub const _ma_channel_position_MA_CHANNEL_TOP_FRONT_RIGHT: _ma_channel_position = 16;
pub const _ma_channel_position_MA_CHANNEL_TOP_BACK_LEFT: _ma_channel_position = 17;
pub const _ma_channel_position_MA_CHANNEL_TOP_BACK_CENTER: _ma_channel_position = 18;
pub const _ma_channel_position_MA_CHANNEL_TOP_BACK_RIGHT: _ma_channel_position = 19;
pub const _ma_channel_position_MA_CHANNEL_AUX_0: _ma_channel_position = 20;
pub const _ma_channel_position_MA_CHANNEL_AUX_1: _ma_channel_position = 21;
pub const _ma_channel_position_MA_CHANNEL_AUX_2: _ma_channel_position = 22;
pub const _ma_channel_position_MA_CHANNEL_AUX_3: _ma_channel_position = 23;
pub const _ma_channel_position_MA_CHANNEL_AUX_4: _ma_channel_position = 24;
pub const _ma_channel_position_MA_CHANNEL_AUX_5: _ma_channel_position = 25;
pub const _ma_channel_position_MA_CHANNEL_AUX_6: _ma_channel_position = 26;
pub const _ma_channel_position_MA_CHANNEL_AUX_7: _ma_channel_position = 27;
pub const _ma_channel_position_MA_CHANNEL_AUX_8: _ma_channel_position = 28;
pub const _ma_channel_position_MA_CHANNEL_AUX_9: _ma_channel_position = 29;
pub const _ma_channel_position_MA_CHANNEL_AUX_10: _ma_channel_position = 30;
pub const _ma_channel_position_MA_CHANNEL_AUX_11: _ma_channel_position = 31;
pub const _ma_channel_position_MA_CHANNEL_AUX_12: _ma_channel_position = 32;
pub const _ma_channel_position_MA_CHANNEL_AUX_13: _ma_channel_position = 33;
pub const _ma_channel_position_MA_CHANNEL_AUX_14: _ma_channel_position = 34;
pub const _ma_channel_position_MA_CHANNEL_AUX_15: _ma_channel_position = 35;
pub const _ma_channel_position_MA_CHANNEL_AUX_16: _ma_channel_position = 36;
pub const _ma_channel_position_MA_CHANNEL_AUX_17: _ma_channel_position = 37;
pub const _ma_channel_position_MA_CHANNEL_AUX_18: _ma_channel_position = 38;
pub const _ma_channel_position_MA_CHANNEL_AUX_19: _ma_channel_position = 39;
pub const _ma_channel_position_MA_CHANNEL_AUX_20: _ma_channel_position = 40;
pub const _ma_channel_position_MA_CHANNEL_AUX_21: _ma_channel_position = 41;
pub const _ma_channel_position_MA_CHANNEL_AUX_22: _ma_channel_position = 42;
pub const _ma_channel_position_MA_CHANNEL_AUX_23: _ma_channel_position = 43;
pub const _ma_channel_position_MA_CHANNEL_AUX_24: _ma_channel_position = 44;
pub const _ma_channel_position_MA_CHANNEL_AUX_25: _ma_channel_position = 45;
pub const _ma_channel_position_MA_CHANNEL_AUX_26: _ma_channel_position = 46;
pub const _ma_channel_position_MA_CHANNEL_AUX_27: _ma_channel_position = 47;
pub const _ma_channel_position_MA_CHANNEL_AUX_28: _ma_channel_position = 48;
pub const _ma_channel_position_MA_CHANNEL_AUX_29: _ma_channel_position = 49;
pub const _ma_channel_position_MA_CHANNEL_AUX_30: _ma_channel_position = 50;
pub const _ma_channel_position_MA_CHANNEL_AUX_31: _ma_channel_position = 51;
pub const _ma_channel_position_MA_CHANNEL_LEFT: _ma_channel_position = 2;
pub const _ma_channel_position_MA_CHANNEL_RIGHT: _ma_channel_position = 3;
pub const _ma_channel_position_MA_CHANNEL_POSITION_COUNT: _ma_channel_position = 52;
pub type _ma_channel_position = ::std::os::raw::c_int;
pub const ma_result_MA_SUCCESS: ma_result = 0;
pub const ma_result_MA_ERROR: ma_result = -1;
pub const ma_result_MA_INVALID_ARGS: ma_result = -2;
pub const ma_result_MA_INVALID_OPERATION: ma_result = -3;
pub const ma_result_MA_OUT_OF_MEMORY: ma_result = -4;
pub const ma_result_MA_OUT_OF_RANGE: ma_result = -5;
pub const ma_result_MA_ACCESS_DENIED: ma_result = -6;
pub const ma_result_MA_DOES_NOT_EXIST: ma_result = -7;
pub const ma_result_MA_ALREADY_EXISTS: ma_result = -8;
pub const ma_result_MA_TOO_MANY_OPEN_FILES: ma_result = -9;
pub const ma_result_MA_INVALID_FILE: ma_result = -10;
pub const ma_result_MA_TOO_BIG: ma_result = -11;
pub const ma_result_MA_PATH_TOO_LONG: ma_result = -12;
pub const ma_result_MA_NAME_TOO_LONG: ma_result = -13;
pub const ma_result_MA_NOT_DIRECTORY: ma_result = -14;
pub const ma_result_MA_IS_DIRECTORY: ma_result = -15;
pub const ma_result_MA_DIRECTORY_NOT_EMPTY: ma_result = -16;
pub const ma_result_MA_AT_END: ma_result = -17;
pub const ma_result_MA_NO_SPACE: ma_result = -18;
pub const ma_result_MA_BUSY: ma_result = -19;
pub const ma_result_MA_IO_ERROR: ma_result = -20;
pub const ma_result_MA_INTERRUPT: ma_result = -21;
pub const ma_result_MA_UNAVAILABLE: ma_result = -22;
pub const ma_result_MA_ALREADY_IN_USE: ma_result = -23;
pub const ma_result_MA_BAD_ADDRESS: ma_result = -24;
pub const ma_result_MA_BAD_SEEK: ma_result = -25;
pub const ma_result_MA_BAD_PIPE: ma_result = -26;
pub const ma_result_MA_DEADLOCK: ma_result = -27;
pub const ma_result_MA_TOO_MANY_LINKS: ma_result = -28;
pub const ma_result_MA_NOT_IMPLEMENTED: ma_result = -29;
pub const ma_result_MA_NO_MESSAGE: ma_result = -30;
pub const ma_result_MA_BAD_MESSAGE: ma_result = -31;
pub const ma_result_MA_NO_DATA_AVAILABLE: ma_result = -32;
pub const ma_result_MA_INVALID_DATA: ma_result = -33;
pub const ma_result_MA_TIMEOUT: ma_result = -34;
pub const ma_result_MA_NO_NETWORK: ma_result = -35;
pub const ma_result_MA_NOT_UNIQUE: ma_result = -36;
pub const ma_result_MA_NOT_SOCKET: ma_result = -37;
pub const ma_result_MA_NO_ADDRESS: ma_result = -38;
pub const ma_result_MA_BAD_PROTOCOL: ma_result = -39;
pub const ma_result_MA_PROTOCOL_UNAVAILABLE: ma_result = -40;
pub const ma_result_MA_PROTOCOL_NOT_SUPPORTED: ma_result = -41;
pub const ma_result_MA_PROTOCOL_FAMILY_NOT_SUPPORTED: ma_result = -42;
pub const ma_result_MA_ADDRESS_FAMILY_NOT_SUPPORTED: ma_result = -43;
pub const ma_result_MA_SOCKET_NOT_SUPPORTED: ma_result = -44;
pub const ma_result_MA_CONNECTION_RESET: ma_result = -45;
pub const ma_result_MA_ALREADY_CONNECTED: ma_result = -46;
pub const ma_result_MA_NOT_CONNECTED: ma_result = -47;
pub const ma_result_MA_CONNECTION_REFUSED: ma_result = -48;
pub const ma_result_MA_NO_HOST: ma_result = -49;
pub const ma_result_MA_IN_PROGRESS: ma_result = -50;
pub const ma_result_MA_CANCELLED: ma_result = -51;
pub const ma_result_MA_MEMORY_ALREADY_MAPPED: ma_result = -52;
pub const ma_result_MA_FORMAT_NOT_SUPPORTED: ma_result = -100;
pub const ma_result_MA_DEVICE_TYPE_NOT_SUPPORTED: ma_result = -101;
pub const ma_result_MA_SHARE_MODE_NOT_SUPPORTED: ma_result = -102;
pub const ma_result_MA_NO_BACKEND: ma_result = -103;
pub const ma_result_MA_NO_DEVICE: ma_result = -104;
pub const ma_result_MA_API_NOT_FOUND: ma_result = -105;
pub const ma_result_MA_INVALID_DEVICE_CONFIG: ma_result = -106;
pub const ma_result_MA_LOOP: ma_result = -107;
pub const ma_result_MA_DEVICE_NOT_INITIALIZED: ma_result = -200;
pub const ma_result_MA_DEVICE_ALREADY_INITIALIZED: ma_result = -201;
pub const ma_result_MA_DEVICE_NOT_STARTED: ma_result = -202;
pub const ma_result_MA_DEVICE_NOT_STOPPED: ma_result = -203;
pub const ma_result_MA_FAILED_TO_INIT_BACKEND: ma_result = -300;
pub const ma_result_MA_FAILED_TO_OPEN_BACKEND_DEVICE: ma_result = -301;
pub const ma_result_MA_FAILED_TO_START_BACKEND_DEVICE: ma_result = -302;
pub const ma_result_MA_FAILED_TO_STOP_BACKEND_DEVICE: ma_result = -303;
pub type ma_result = ::std::os::raw::c_int;
pub const ma_stream_format_ma_stream_format_pcm: ma_stream_format = 0;
pub type ma_stream_format = ::std::os::raw::c_int;
pub const ma_stream_layout_ma_stream_layout_interleaved: ma_stream_layout = 0;
pub const ma_stream_layout_ma_stream_layout_deinterleaved: ma_stream_layout = 1;
pub type ma_stream_layout = ::std::os::raw::c_int;
pub const ma_dither_mode_ma_dither_mode_none: ma_dither_mode = 0;
pub const ma_dither_mode_ma_dither_mode_rectangle: ma_dither_mode = 1;
pub const ma_dither_mode_ma_dither_mode_triangle: ma_dither_mode = 2;
pub type ma_dither_mode = ::std::os::raw::c_int;
pub const ma_format_ma_format_unknown: ma_format = 0;
pub const ma_format_ma_format_u8: ma_format = 1;
pub const ma_format_ma_format_s16: ma_format = 2;
pub const ma_format_ma_format_s24: ma_format = 3;
pub const ma_format_ma_format_s32: ma_format = 4;
pub const ma_format_ma_format_f32: ma_format = 5;
pub const ma_format_ma_format_count: ma_format = 6;
pub type ma_format = ::std::os::raw::c_int;
pub const ma_standard_sample_rate_ma_standard_sample_rate_48000: ma_standard_sample_rate = 48000;
pub const ma_standard_sample_rate_ma_standard_sample_rate_44100: ma_standard_sample_rate = 44100;
pub const ma_standard_sample_rate_ma_standard_sample_rate_32000: ma_standard_sample_rate = 32000;
pub const ma_standard_sample_rate_ma_standard_sample_rate_24000: ma_standard_sample_rate = 24000;
pub const ma_standard_sample_rate_ma_standard_sample_rate_22050: ma_standard_sample_rate = 22050;
pub const ma_standard_sample_rate_ma_standard_sample_rate_88200: ma_standard_sample_rate = 88200;
pub const ma_standard_sample_rate_ma_standard_sample_rate_96000: ma_standard_sample_rate = 96000;
pub const ma_standard_sample_rate_ma_standard_sample_rate_176400: ma_standard_sample_rate = 176400;
pub const ma_standard_sample_rate_ma_standard_sample_rate_192000: ma_standard_sample_rate = 192000;
pub const ma_standard_sample_rate_ma_standard_sample_rate_16000: ma_standard_sample_rate = 16000;
pub const ma_standard_sample_rate_ma_standard_sample_rate_11025: ma_standard_sample_rate = 11250;
pub const ma_standard_sample_rate_ma_standard_sample_rate_8000: ma_standard_sample_rate = 8000;
pub const ma_standard_sample_rate_ma_standard_sample_rate_352800: ma_standard_sample_rate = 352800;
pub const ma_standard_sample_rate_ma_standard_sample_rate_384000: ma_standard_sample_rate = 384000;
pub const ma_standard_sample_rate_ma_standard_sample_rate_min: ma_standard_sample_rate = 8000;
pub const ma_standard_sample_rate_ma_standard_sample_rate_max: ma_standard_sample_rate = 384000;
pub const ma_standard_sample_rate_ma_standard_sample_rate_count: ma_standard_sample_rate = 14;
pub type ma_standard_sample_rate = ::std::os::raw::c_int;
pub const ma_channel_mix_mode_ma_channel_mix_mode_rectangular: ma_channel_mix_mode = 0;
pub const ma_channel_mix_mode_ma_channel_mix_mode_simple: ma_channel_mix_mode = 1;
pub const ma_channel_mix_mode_ma_channel_mix_mode_custom_weights: ma_channel_mix_mode = 2;
pub const ma_channel_mix_mode_ma_channel_mix_mode_default: ma_channel_mix_mode = 0;
pub type ma_channel_mix_mode = ::std::os::raw::c_int;
pub const ma_standard_channel_map_ma_standard_channel_map_microsoft: ma_standard_channel_map = 0;
pub const ma_standard_channel_map_ma_standard_channel_map_alsa: ma_standard_channel_map = 1;
pub const ma_standard_channel_map_ma_standard_channel_map_rfc3551: ma_standard_channel_map = 2;
pub const ma_standard_channel_map_ma_standard_channel_map_flac: ma_standard_channel_map = 3;
pub const ma_standard_channel_map_ma_standard_channel_map_vorbis: ma_standard_channel_map = 4;
pub const ma_standard_channel_map_ma_standard_channel_map_sound4: ma_standard_channel_map = 5;
pub const ma_standard_channel_map_ma_standard_channel_map_sndio: ma_standard_channel_map = 6;
pub const ma_standard_channel_map_ma_standard_channel_map_webaudio: ma_standard_channel_map = 3;
pub const ma_standard_channel_map_ma_standard_channel_map_default: ma_standard_channel_map = 0;
pub type ma_standard_channel_map = ::std::os::raw::c_int;
pub const ma_performance_profile_ma_performance_profile_low_latency: ma_performance_profile = 0;
pub const ma_performance_profile_ma_performance_profile_conservative: ma_performance_profile = 1;
pub type ma_performance_profile = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_allocation_callbacks {
    pub pUserData: *mut ::std::os::raw::c_void,
    pub onMalloc: ::std::option::Option<
        unsafe extern "C" fn(
            sz: usize,
            pUserData: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub onRealloc: ::std::option::Option<
        unsafe extern "C" fn(
            p: *mut ::std::os::raw::c_void,
            sz: usize,
            pUserData: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub onFree: ::std::option::Option<
        unsafe extern "C" fn(
            p: *mut ::std::os::raw::c_void,
            pUserData: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[test]
fn bindgen_test_layout_ma_allocation_callbacks() {
    const UNINIT: ::std::mem::MaybeUninit<ma_allocation_callbacks> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_allocation_callbacks>(),
        32usize,
        concat!("Size of: ", stringify!(ma_allocation_callbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_allocation_callbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_allocation_callbacks))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pUserData) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_allocation_callbacks),
        "::",
        stringify!(pUserData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onMalloc) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_allocation_callbacks),
        "::",
        stringify!(onMalloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onRealloc) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_allocation_callbacks),
        "::",
        stringify!(onRealloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onFree) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_allocation_callbacks),
        "::",
        stringify!(onFree)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_lcg {
    pub state: ma_int32,
}
#[test]
fn bindgen_test_layout_ma_lcg() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lcg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lcg>(),
        4usize,
        concat!("Size of: ", stringify!(ma_lcg))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lcg>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_lcg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lcg),
        "::",
        stringify!(state)
        )
    );
}
pub type ma_spinlock = ma_uint32;
pub const ma_thread_priority_ma_thread_priority_idle: ma_thread_priority = -5;
pub const ma_thread_priority_ma_thread_priority_lowest: ma_thread_priority = -4;
pub const ma_thread_priority_ma_thread_priority_low: ma_thread_priority = -3;
pub const ma_thread_priority_ma_thread_priority_normal: ma_thread_priority = -2;
pub const ma_thread_priority_ma_thread_priority_high: ma_thread_priority = -1;
pub const ma_thread_priority_ma_thread_priority_highest: ma_thread_priority = 0;
pub const ma_thread_priority_ma_thread_priority_realtime: ma_thread_priority = 1;
pub const ma_thread_priority_ma_thread_priority_default: ma_thread_priority = 0;
pub type ma_thread_priority = ::std::os::raw::c_int;
pub type ma_thread = ma_handle;
pub type ma_mutex = ma_handle;
pub type ma_event = ma_handle;
pub type ma_semaphore = ma_handle;
extern "C" {
    pub fn ma_version(pMajor: *mut ma_uint32, pMinor: *mut ma_uint32, pRevision: *mut ma_uint32);
}
extern "C" {
    pub fn ma_version_string() -> *const ::std::os::raw::c_char;
}
pub type ma_log_callback_proc = ::std::option::Option<
    unsafe extern "C" fn(
        pUserData: *mut ::std::os::raw::c_void,
        level: ma_uint32,
        pMessage: *const ::std::os::raw::c_char,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_log_callback {
    pub onLog: ma_log_callback_proc,
    pub pUserData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ma_log_callback() {
    const UNINIT: ::std::mem::MaybeUninit<ma_log_callback> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_log_callback>(),
        16usize,
        concat!("Size of: ", stringify!(ma_log_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_log_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_log_callback))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onLog) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_log_callback),
        "::",
        stringify!(onLog)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pUserData) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_log_callback),
        "::",
        stringify!(pUserData)
        )
    );
}
extern "C" {
    pub fn ma_log_callback_init(
        onLog: ma_log_callback_proc,
        pUserData: *mut ::std::os::raw::c_void,
    ) -> ma_log_callback;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_log {
    pub callbacks: [ma_log_callback; 4usize],
    pub callbackCount: ma_uint32,
    pub allocationCallbacks: ma_allocation_callbacks,
    pub lock: ma_mutex,
}
#[test]
fn bindgen_test_layout_ma_log() {
    const UNINIT: ::std::mem::MaybeUninit<ma_log> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_log>(),
        112usize,
        concat!("Size of: ", stringify!(ma_log))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_log>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_log))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callbacks) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_log),
        "::",
        stringify!(callbacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callbackCount) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_log),
        "::",
        stringify!(callbackCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocationCallbacks) as usize - ptr as usize },
        72usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_log),
        "::",
        stringify!(allocationCallbacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        104usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_log),
        "::",
        stringify!(lock)
        )
    );
}
extern "C" {
    pub fn ma_log_init(
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pLog: *mut ma_log,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_log_uninit(pLog: *mut ma_log);
}
extern "C" {
    pub fn ma_log_register_callback(pLog: *mut ma_log, callback: ma_log_callback) -> ma_result;
}
extern "C" {
    pub fn ma_log_unregister_callback(pLog: *mut ma_log, callback: ma_log_callback) -> ma_result;
}
extern "C" {
    pub fn ma_log_post(
        pLog: *mut ma_log,
        level: ma_uint32,
        pMessage: *const ::std::os::raw::c_char,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_log_postv(
        pLog: *mut ma_log,
        level: ma_uint32,
        pFormat: *const ::std::os::raw::c_char,
        args: va_list,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_log_postf(
        pLog: *mut ma_log,
        level: ma_uint32,
        pFormat: *const ::std::os::raw::c_char,
        ...
    ) -> ma_result;
}
#[doc = "Biquad Filtering"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_biquad_coefficient {
    pub f32_: f32,
    pub s32: ma_int32,
}
#[test]
fn bindgen_test_layout_ma_biquad_coefficient() {
    const UNINIT: ::std::mem::MaybeUninit<ma_biquad_coefficient> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_biquad_coefficient>(),
        4usize,
        concat!("Size of: ", stringify!(ma_biquad_coefficient))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_biquad_coefficient>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_biquad_coefficient))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad_coefficient),
        "::",
        stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad_coefficient),
        "::",
        stringify!(s32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_biquad_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub b0: f64,
    pub b1: f64,
    pub b2: f64,
    pub a0: f64,
    pub a1: f64,
    pub a2: f64,
}
#[test]
fn bindgen_test_layout_ma_biquad_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_biquad_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_biquad_config>(),
        56usize,
        concat!("Size of: ", stringify!(ma_biquad_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_biquad_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_biquad_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b0) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad_config),
        "::",
        stringify!(b0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b1) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad_config),
        "::",
        stringify!(b1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b2) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad_config),
        "::",
        stringify!(b2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a0) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad_config),
        "::",
        stringify!(a0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a1) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad_config),
        "::",
        stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a2) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad_config),
        "::",
        stringify!(a2)
        )
    );
}
extern "C" {
    pub fn ma_biquad_config_init(
        format: ma_format,
        channels: ma_uint32,
        b0: f64,
        b1: f64,
        b2: f64,
        a0: f64,
        a1: f64,
        a2: f64,
    ) -> ma_biquad_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_biquad {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub b0: ma_biquad_coefficient,
    pub b1: ma_biquad_coefficient,
    pub b2: ma_biquad_coefficient,
    pub a1: ma_biquad_coefficient,
    pub a2: ma_biquad_coefficient,
    pub pR1: *mut ma_biquad_coefficient,
    pub pR2: *mut ma_biquad_coefficient,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_biquad() {
    const UNINIT: ::std::mem::MaybeUninit<ma_biquad> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_biquad>(),
        64usize,
        concat!("Size of: ", stringify!(ma_biquad))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_biquad>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_biquad))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b0) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad),
        "::",
        stringify!(b0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b1) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad),
        "::",
        stringify!(b1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b2) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad),
        "::",
        stringify!(b2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a1) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad),
        "::",
        stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a2) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad),
        "::",
        stringify!(a2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pR1) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad),
        "::",
        stringify!(pR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pR2) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad),
        "::",
        stringify!(pR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_biquad),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_biquad_get_heap_size(
        pConfig: *const ma_biquad_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_init_preallocated(
        pConfig: *const ma_biquad_config,
        pHeap: *mut ::std::os::raw::c_void,
        pBQ: *mut ma_biquad,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_init(
        pConfig: *const ma_biquad_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pBQ: *mut ma_biquad,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_uninit(
        pBQ: *mut ma_biquad,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_biquad_reinit(pConfig: *const ma_biquad_config, pBQ: *mut ma_biquad) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_clear_cache(pBQ: *mut ma_biquad) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_process_pcm_frames(
        pBQ: *mut ma_biquad,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_get_latency(pBQ: *const ma_biquad) -> ma_uint32;
}
#[doc = "Low-Pass Filtering"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_lpf1_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_lpf1_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lpf1_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lpf1_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_lpf1_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf1_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf1_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf1_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf1_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf1_config),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf1_config),
        "::",
        stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf1_config),
        "::",
        stringify!(q)
        )
    );
}
#[doc = "Low-Pass Filtering"]
pub type ma_lpf2_config = ma_lpf1_config;
extern "C" {
    pub fn ma_lpf1_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
    ) -> ma_lpf1_config;
}
extern "C" {
    pub fn ma_lpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_lpf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_lpf1 {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub a: ma_biquad_coefficient,
    pub pR1: *mut ma_biquad_coefficient,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_lpf1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lpf1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lpf1>(),
        40usize,
        concat!("Size of: ", stringify!(ma_lpf1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf1),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf1),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf1),
        "::",
        stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pR1) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf1),
        "::",
        stringify!(pR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf1),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf1),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_lpf1_get_heap_size(
        pConfig: *const ma_lpf1_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_init_preallocated(
        pConfig: *const ma_lpf1_config,
        pHeap: *mut ::std::os::raw::c_void,
        pLPF: *mut ma_lpf1,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_init(
        pConfig: *const ma_lpf1_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pLPF: *mut ma_lpf1,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_uninit(pLPF: *mut ma_lpf1, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_lpf1_reinit(pConfig: *const ma_lpf1_config, pLPF: *mut ma_lpf1) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_clear_cache(pLPF: *mut ma_lpf1) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_process_pcm_frames(
        pLPF: *mut ma_lpf1,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_get_latency(pLPF: *const ma_lpf1) -> ma_uint32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_lpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_lpf2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lpf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lpf2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_lpf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf2),
        "::",
        stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_lpf2_get_heap_size(
        pConfig: *const ma_lpf2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_init_preallocated(
        pConfig: *const ma_lpf2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pHPF: *mut ma_lpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_init(
        pConfig: *const ma_lpf2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pLPF: *mut ma_lpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_uninit(pLPF: *mut ma_lpf2, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_lpf2_reinit(pConfig: *const ma_lpf2_config, pLPF: *mut ma_lpf2) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_clear_cache(pLPF: *mut ma_lpf2) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_process_pcm_frames(
        pLPF: *mut ma_lpf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_get_latency(pLPF: *const ma_lpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_lpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_lpf_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lpf_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_lpf_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf_config),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf_config),
        "::",
        stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf_config),
        "::",
        stringify!(order)
        )
    );
}
extern "C" {
    pub fn ma_lpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_lpf_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_lpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub lpf1Count: ma_uint32,
    pub lpf2Count: ma_uint32,
    pub pLPF1: *mut ma_lpf1,
    pub pLPF2: *mut ma_lpf2,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_lpf() {
    const UNINIT: ::std::mem::MaybeUninit<ma_lpf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_lpf>(),
        56usize,
        concat!("Size of: ", stringify!(ma_lpf))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpf1Count) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf),
        "::",
        stringify!(lpf1Count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpf2Count) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf),
        "::",
        stringify!(lpf2Count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pLPF1) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf),
        "::",
        stringify!(pLPF1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pLPF2) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf),
        "::",
        stringify!(pLPF2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_lpf),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_lpf_get_heap_size(
        pConfig: *const ma_lpf_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_init_preallocated(
        pConfig: *const ma_lpf_config,
        pHeap: *mut ::std::os::raw::c_void,
        pLPF: *mut ma_lpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_init(
        pConfig: *const ma_lpf_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pLPF: *mut ma_lpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_uninit(pLPF: *mut ma_lpf, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_lpf_reinit(pConfig: *const ma_lpf_config, pLPF: *mut ma_lpf) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_clear_cache(pLPF: *mut ma_lpf) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_process_pcm_frames(
        pLPF: *mut ma_lpf,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_get_latency(pLPF: *const ma_lpf) -> ma_uint32;
}
#[doc = "High-Pass Filtering"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_hpf1_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_hpf1_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hpf1_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hpf1_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_hpf1_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf1_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf1_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf1_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf1_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf1_config),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf1_config),
        "::",
        stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf1_config),
        "::",
        stringify!(q)
        )
    );
}
#[doc = "High-Pass Filtering"]
pub type ma_hpf2_config = ma_hpf1_config;
extern "C" {
    pub fn ma_hpf1_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
    ) -> ma_hpf1_config;
}
extern "C" {
    pub fn ma_hpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_hpf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_hpf1 {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub a: ma_biquad_coefficient,
    pub pR1: *mut ma_biquad_coefficient,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_hpf1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hpf1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hpf1>(),
        40usize,
        concat!("Size of: ", stringify!(ma_hpf1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf1),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf1),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf1),
        "::",
        stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pR1) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf1),
        "::",
        stringify!(pR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf1),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf1),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_hpf1_get_heap_size(
        pConfig: *const ma_hpf1_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_init_preallocated(
        pConfig: *const ma_hpf1_config,
        pHeap: *mut ::std::os::raw::c_void,
        pLPF: *mut ma_hpf1,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_init(
        pConfig: *const ma_hpf1_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pHPF: *mut ma_hpf1,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_uninit(pHPF: *mut ma_hpf1, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_hpf1_reinit(pConfig: *const ma_hpf1_config, pHPF: *mut ma_hpf1) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_process_pcm_frames(
        pHPF: *mut ma_hpf1,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_get_latency(pHPF: *const ma_hpf1) -> ma_uint32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_hpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_hpf2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hpf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hpf2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_hpf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf2),
        "::",
        stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_hpf2_get_heap_size(
        pConfig: *const ma_hpf2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_init_preallocated(
        pConfig: *const ma_hpf2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pHPF: *mut ma_hpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_init(
        pConfig: *const ma_hpf2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pHPF: *mut ma_hpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_uninit(pHPF: *mut ma_hpf2, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_hpf2_reinit(pConfig: *const ma_hpf2_config, pHPF: *mut ma_hpf2) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_process_pcm_frames(
        pHPF: *mut ma_hpf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_get_latency(pHPF: *const ma_hpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_hpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_hpf_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hpf_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_hpf_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf_config),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf_config),
        "::",
        stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf_config),
        "::",
        stringify!(order)
        )
    );
}
extern "C" {
    pub fn ma_hpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_hpf_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_hpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub hpf1Count: ma_uint32,
    pub hpf2Count: ma_uint32,
    pub pHPF1: *mut ma_hpf1,
    pub pHPF2: *mut ma_hpf2,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_hpf() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hpf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hpf>(),
        56usize,
        concat!("Size of: ", stringify!(ma_hpf))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hpf1Count) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf),
        "::",
        stringify!(hpf1Count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hpf2Count) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf),
        "::",
        stringify!(hpf2Count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pHPF1) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf),
        "::",
        stringify!(pHPF1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pHPF2) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf),
        "::",
        stringify!(pHPF2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hpf),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_hpf_get_heap_size(
        pConfig: *const ma_hpf_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_init_preallocated(
        pConfig: *const ma_hpf_config,
        pHeap: *mut ::std::os::raw::c_void,
        pLPF: *mut ma_hpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_init(
        pConfig: *const ma_hpf_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pHPF: *mut ma_hpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_uninit(pHPF: *mut ma_hpf, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_hpf_reinit(pConfig: *const ma_hpf_config, pHPF: *mut ma_hpf) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_process_pcm_frames(
        pHPF: *mut ma_hpf,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_get_latency(pHPF: *const ma_hpf) -> ma_uint32;
}
#[doc = "Band-Pass Filtering"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_bpf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_bpf2_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_bpf2_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_bpf2_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_bpf2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf2_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf2_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf2_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf2_config),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf2_config),
        "::",
        stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf2_config),
        "::",
        stringify!(q)
        )
    );
}
extern "C" {
    pub fn ma_bpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_bpf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_bpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_bpf2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_bpf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_bpf2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_bpf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf2),
        "::",
        stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_bpf2_get_heap_size(
        pConfig: *const ma_bpf2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_init_preallocated(
        pConfig: *const ma_bpf2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pBPF: *mut ma_bpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_init(
        pConfig: *const ma_bpf2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pBPF: *mut ma_bpf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_uninit(pBPF: *mut ma_bpf2, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_bpf2_reinit(pConfig: *const ma_bpf2_config, pBPF: *mut ma_bpf2) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_process_pcm_frames(
        pBPF: *mut ma_bpf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_get_latency(pBPF: *const ma_bpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_bpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_bpf_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_bpf_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_bpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_bpf_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf_config),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf_config),
        "::",
        stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf_config),
        "::",
        stringify!(order)
        )
    );
}
extern "C" {
    pub fn ma_bpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_bpf_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_bpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub bpf2Count: ma_uint32,
    pub pBPF2: *mut ma_bpf2,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_bpf() {
    const UNINIT: ::std::mem::MaybeUninit<ma_bpf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_bpf>(),
        40usize,
        concat!("Size of: ", stringify!(ma_bpf))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bpf2Count) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf),
        "::",
        stringify!(bpf2Count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBPF2) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf),
        "::",
        stringify!(pBPF2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_bpf),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_bpf_get_heap_size(
        pConfig: *const ma_bpf_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_init_preallocated(
        pConfig: *const ma_bpf_config,
        pHeap: *mut ::std::os::raw::c_void,
        pBPF: *mut ma_bpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_init(
        pConfig: *const ma_bpf_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pBPF: *mut ma_bpf,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_uninit(pBPF: *mut ma_bpf, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_bpf_reinit(pConfig: *const ma_bpf_config, pBPF: *mut ma_bpf) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_process_pcm_frames(
        pBPF: *mut ma_bpf,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_get_latency(pBPF: *const ma_bpf) -> ma_uint32;
}
#[doc = "Notching Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_notch2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub q: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_notch2_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_notch2_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_notch2_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_notch2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_notch2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_notch2_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_notch2_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_notch2_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_notch2_config),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_notch2_config),
        "::",
        stringify!(q)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_notch2_config),
        "::",
        stringify!(frequency)
        )
    );
}
#[doc = "Notching Filter"]
pub type ma_notch_config = ma_notch2_config;
extern "C" {
    pub fn ma_notch2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        q: f64,
        frequency: f64,
    ) -> ma_notch2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_notch2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_notch2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_notch2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_notch2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_notch2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_notch2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_notch2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_notch2),
        "::",
        stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_notch2_get_heap_size(
        pConfig: *const ma_notch2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_init_preallocated(
        pConfig: *const ma_notch2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pFilter: *mut ma_notch2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_init(
        pConfig: *const ma_notch2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pFilter: *mut ma_notch2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_uninit(
        pFilter: *mut ma_notch2,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_notch2_reinit(pConfig: *const ma_notch2_config, pFilter: *mut ma_notch2)
                            -> ma_result;
}
extern "C" {
    pub fn ma_notch2_process_pcm_frames(
        pFilter: *mut ma_notch2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_get_latency(pFilter: *const ma_notch2) -> ma_uint32;
}
#[doc = "Peaking EQ Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_peak2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub q: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_peak2_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_peak2_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_peak2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_peak2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_peak2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_peak2_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_peak2_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_peak2_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_peak2_config),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainDB) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_peak2_config),
        "::",
        stringify!(gainDB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_peak2_config),
        "::",
        stringify!(q)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_peak2_config),
        "::",
        stringify!(frequency)
        )
    );
}
#[doc = "Peaking EQ Filter"]
pub type ma_peak_config = ma_peak2_config;
extern "C" {
    pub fn ma_peak2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        q: f64,
        frequency: f64,
    ) -> ma_peak2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_peak2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_peak2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_peak2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_peak2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_peak2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_peak2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_peak2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_peak2),
        "::",
        stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_peak2_get_heap_size(
        pConfig: *const ma_peak2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_init_preallocated(
        pConfig: *const ma_peak2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pFilter: *mut ma_peak2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_init(
        pConfig: *const ma_peak2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pFilter: *mut ma_peak2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_uninit(
        pFilter: *mut ma_peak2,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_peak2_reinit(pConfig: *const ma_peak2_config, pFilter: *mut ma_peak2) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_process_pcm_frames(
        pFilter: *mut ma_peak2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_get_latency(pFilter: *const ma_peak2) -> ma_uint32;
}
#[doc = "Low Shelf Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_loshelf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub shelfSlope: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_loshelf2_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_loshelf2_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_loshelf2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_loshelf2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_loshelf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_loshelf2_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_loshelf2_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_loshelf2_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_loshelf2_config),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainDB) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_loshelf2_config),
        "::",
        stringify!(gainDB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shelfSlope) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_loshelf2_config),
        "::",
        stringify!(shelfSlope)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_loshelf2_config),
        "::",
        stringify!(frequency)
        )
    );
}
#[doc = "Low Shelf Filter"]
pub type ma_loshelf_config = ma_loshelf2_config;
extern "C" {
    pub fn ma_loshelf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        shelfSlope: f64,
        frequency: f64,
    ) -> ma_loshelf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_loshelf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_loshelf2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_loshelf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_loshelf2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_loshelf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_loshelf2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_loshelf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_loshelf2),
        "::",
        stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_loshelf2_get_heap_size(
        pConfig: *const ma_loshelf2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_init_preallocated(
        pConfig: *const ma_loshelf2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pFilter: *mut ma_loshelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_init(
        pConfig: *const ma_loshelf2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pFilter: *mut ma_loshelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_uninit(
        pFilter: *mut ma_loshelf2,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_loshelf2_reinit(
        pConfig: *const ma_loshelf2_config,
        pFilter: *mut ma_loshelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_process_pcm_frames(
        pFilter: *mut ma_loshelf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_get_latency(pFilter: *const ma_loshelf2) -> ma_uint32;
}
#[doc = "High Shelf Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_hishelf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub shelfSlope: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_hishelf2_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hishelf2_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hishelf2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_hishelf2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hishelf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hishelf2_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hishelf2_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hishelf2_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hishelf2_config),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainDB) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hishelf2_config),
        "::",
        stringify!(gainDB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shelfSlope) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hishelf2_config),
        "::",
        stringify!(shelfSlope)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hishelf2_config),
        "::",
        stringify!(frequency)
        )
    );
}
#[doc = "High Shelf Filter"]
pub type ma_hishelf_config = ma_hishelf2_config;
extern "C" {
    pub fn ma_hishelf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        shelfSlope: f64,
        frequency: f64,
    ) -> ma_hishelf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_hishelf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_hishelf2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_hishelf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_hishelf2>(),
        64usize,
        concat!("Size of: ", stringify!(ma_hishelf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hishelf2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hishelf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_hishelf2),
        "::",
        stringify!(bq)
        )
    );
}
extern "C" {
    pub fn ma_hishelf2_get_heap_size(
        pConfig: *const ma_hishelf2_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_init_preallocated(
        pConfig: *const ma_hishelf2_config,
        pHeap: *mut ::std::os::raw::c_void,
        pFilter: *mut ma_hishelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_init(
        pConfig: *const ma_hishelf2_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pFilter: *mut ma_hishelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_uninit(
        pFilter: *mut ma_hishelf2,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_hishelf2_reinit(
        pConfig: *const ma_hishelf2_config,
        pFilter: *mut ma_hishelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_process_pcm_frames(
        pFilter: *mut ma_hishelf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_get_latency(pFilter: *const ma_hishelf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_delay_config {
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub delayInFrames: ma_uint32,
    pub delayStart: ma_bool32,
    pub wet: f32,
    pub dry: f32,
    pub decay: f32,
}
#[test]
fn bindgen_test_layout_ma_delay_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_delay_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_delay_config>(),
        28usize,
        concat!("Size of: ", stringify!(ma_delay_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_delay_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_delay_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_delay_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_delay_config),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delayInFrames) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_delay_config),
        "::",
        stringify!(delayInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delayStart) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_delay_config),
        "::",
        stringify!(delayStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wet) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_delay_config),
        "::",
        stringify!(wet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dry) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_delay_config),
        "::",
        stringify!(dry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decay) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_delay_config),
        "::",
        stringify!(decay)
        )
    );
}
extern "C" {
    pub fn ma_delay_config_init(
        channels: ma_uint32,
        sampleRate: ma_uint32,
        delayInFrames: ma_uint32,
        decay: f32,
    ) -> ma_delay_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_delay {
    pub config: ma_delay_config,
    pub cursor: ma_uint32,
    pub bufferSizeInFrames: ma_uint32,
    pub pBuffer: *mut f32,
}
#[test]
fn bindgen_test_layout_ma_delay() {
    const UNINIT: ::std::mem::MaybeUninit<ma_delay> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_delay>(),
        48usize,
        concat!("Size of: ", stringify!(ma_delay))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_delay>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_delay))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_delay),
        "::",
        stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cursor) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_delay),
        "::",
        stringify!(cursor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bufferSizeInFrames) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_delay),
        "::",
        stringify!(bufferSizeInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBuffer) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_delay),
        "::",
        stringify!(pBuffer)
        )
    );
}
extern "C" {
    pub fn ma_delay_init(
        pConfig: *const ma_delay_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pDelay: *mut ma_delay,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_delay_uninit(
        pDelay: *mut ma_delay,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_delay_process_pcm_frames(
        pDelay: *mut ma_delay,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_delay_set_wet(pDelay: *mut ma_delay, value: f32);
}
extern "C" {
    pub fn ma_delay_get_wet(pDelay: *const ma_delay) -> f32;
}
extern "C" {
    pub fn ma_delay_set_dry(pDelay: *mut ma_delay, value: f32);
}
extern "C" {
    pub fn ma_delay_get_dry(pDelay: *const ma_delay) -> f32;
}
extern "C" {
    pub fn ma_delay_set_decay(pDelay: *mut ma_delay, value: f32);
}
extern "C" {
    pub fn ma_delay_get_decay(pDelay: *const ma_delay) -> f32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_gainer_config {
    pub channels: ma_uint32,
    pub smoothTimeInFrames: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_gainer_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_gainer_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_gainer_config>(),
        8usize,
        concat!("Size of: ", stringify!(ma_gainer_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_gainer_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_gainer_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_gainer_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).smoothTimeInFrames) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_gainer_config),
        "::",
        stringify!(smoothTimeInFrames)
        )
    );
}
extern "C" {
    pub fn ma_gainer_config_init(
        channels: ma_uint32,
        smoothTimeInFrames: ma_uint32,
    ) -> ma_gainer_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_gainer {
    pub config: ma_gainer_config,
    pub t: ma_uint32,
    pub pOldGains: *mut f32,
    pub pNewGains: *mut f32,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_gainer() {
    const UNINIT: ::std::mem::MaybeUninit<ma_gainer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_gainer>(),
        48usize,
        concat!("Size of: ", stringify!(ma_gainer))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_gainer>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_gainer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_gainer),
        "::",
        stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_gainer),
        "::",
        stringify!(t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pOldGains) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_gainer),
        "::",
        stringify!(pOldGains)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pNewGains) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_gainer),
        "::",
        stringify!(pNewGains)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_gainer),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_gainer),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_gainer_get_heap_size(
        pConfig: *const ma_gainer_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_init_preallocated(
        pConfig: *const ma_gainer_config,
        pHeap: *mut ::std::os::raw::c_void,
        pGainer: *mut ma_gainer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_init(
        pConfig: *const ma_gainer_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pGainer: *mut ma_gainer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_uninit(
        pGainer: *mut ma_gainer,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_gainer_process_pcm_frames(
        pGainer: *mut ma_gainer,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_set_gain(pGainer: *mut ma_gainer, newGain: f32) -> ma_result;
}
extern "C" {
    pub fn ma_gainer_set_gains(pGainer: *mut ma_gainer, pNewGains: *mut f32) -> ma_result;
}
pub const ma_pan_mode_ma_pan_mode_balance: ma_pan_mode = 0;
pub const ma_pan_mode_ma_pan_mode_pan: ma_pan_mode = 1;
pub type ma_pan_mode = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_panner_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub mode: ma_pan_mode,
    pub pan: f32,
}
#[test]
fn bindgen_test_layout_ma_panner_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_panner_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_panner_config>(),
        16usize,
        concat!("Size of: ", stringify!(ma_panner_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_panner_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_panner_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_panner_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_panner_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_panner_config),
        "::",
        stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pan) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_panner_config),
        "::",
        stringify!(pan)
        )
    );
}
extern "C" {
    pub fn ma_panner_config_init(format: ma_format, channels: ma_uint32) -> ma_panner_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_panner {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub mode: ma_pan_mode,
    pub pan: f32,
}
#[test]
fn bindgen_test_layout_ma_panner() {
    const UNINIT: ::std::mem::MaybeUninit<ma_panner> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_panner>(),
        16usize,
        concat!("Size of: ", stringify!(ma_panner))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_panner>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_panner))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_panner),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_panner),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_panner),
        "::",
        stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pan) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_panner),
        "::",
        stringify!(pan)
        )
    );
}
extern "C" {
    pub fn ma_panner_init(pConfig: *const ma_panner_config, pPanner: *mut ma_panner) -> ma_result;
}
extern "C" {
    pub fn ma_panner_process_pcm_frames(
        pPanner: *mut ma_panner,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_panner_set_mode(pPanner: *mut ma_panner, mode: ma_pan_mode);
}
extern "C" {
    pub fn ma_panner_get_mode(pPanner: *const ma_panner) -> ma_pan_mode;
}
extern "C" {
    pub fn ma_panner_set_pan(pPanner: *mut ma_panner, pan: f32);
}
extern "C" {
    pub fn ma_panner_get_pan(pPanner: *const ma_panner) -> f32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_fader_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_fader_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_fader_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_fader_config>(),
        12usize,
        concat!("Size of: ", stringify!(ma_fader_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_fader_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_fader_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_fader_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_fader_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_fader_config),
        "::",
        stringify!(sampleRate)
        )
    );
}
extern "C" {
    pub fn ma_fader_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
    ) -> ma_fader_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_fader {
    pub config: ma_fader_config,
    pub volumeBeg: f32,
    pub volumeEnd: f32,
    pub lengthInFrames: ma_uint64,
    pub cursorInFrames: ma_uint64,
}
#[test]
fn bindgen_test_layout_ma_fader() {
    const UNINIT: ::std::mem::MaybeUninit<ma_fader> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_fader>(),
        40usize,
        concat!("Size of: ", stringify!(ma_fader))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_fader>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_fader))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_fader),
        "::",
        stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).volumeBeg) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_fader),
        "::",
        stringify!(volumeBeg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).volumeEnd) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_fader),
        "::",
        stringify!(volumeEnd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lengthInFrames) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_fader),
        "::",
        stringify!(lengthInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cursorInFrames) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_fader),
        "::",
        stringify!(cursorInFrames)
        )
    );
}
extern "C" {
    pub fn ma_fader_init(pConfig: *const ma_fader_config, pFader: *mut ma_fader) -> ma_result;
}
extern "C" {
    pub fn ma_fader_process_pcm_frames(
        pFader: *mut ma_fader,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_fader_get_data_format(
        pFader: *const ma_fader,
        pFormat: *mut ma_format,
        pChannels: *mut ma_uint32,
        pSampleRate: *mut ma_uint32,
    );
}
extern "C" {
    pub fn ma_fader_set_fade(
        pFader: *mut ma_fader,
        volumeBeg: f32,
        volumeEnd: f32,
        lengthInFrames: ma_uint64,
    );
}
extern "C" {
    pub fn ma_fader_get_current_volume(pFader: *mut ma_fader) -> f32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_vec3f {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[test]
fn bindgen_test_layout_ma_vec3f() {
    const UNINIT: ::std::mem::MaybeUninit<ma_vec3f> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_vec3f>(),
        12usize,
        concat!("Size of: ", stringify!(ma_vec3f))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_vec3f>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_vec3f))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_vec3f),
        "::",
        stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_vec3f),
        "::",
        stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_vec3f),
        "::",
        stringify!(z)
        )
    );
}
pub const ma_attenuation_model_ma_attenuation_model_none: ma_attenuation_model = 0;
pub const ma_attenuation_model_ma_attenuation_model_inverse: ma_attenuation_model = 1;
pub const ma_attenuation_model_ma_attenuation_model_linear: ma_attenuation_model = 2;
pub const ma_attenuation_model_ma_attenuation_model_exponential: ma_attenuation_model = 3;
pub type ma_attenuation_model = ::std::os::raw::c_int;
pub const ma_positioning_ma_positioning_absolute: ma_positioning = 0;
pub const ma_positioning_ma_positioning_relative: ma_positioning = 1;
pub type ma_positioning = ::std::os::raw::c_int;
pub const ma_handedness_ma_handedness_right: ma_handedness = 0;
pub const ma_handedness_ma_handedness_left: ma_handedness = 1;
pub type ma_handedness = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_spatializer_listener_config {
    pub channelsOut: ma_uint32,
    pub pChannelMapOut: *mut ma_channel,
    pub handedness: ma_handedness,
    pub coneInnerAngleInRadians: f32,
    pub coneOuterAngleInRadians: f32,
    pub coneOuterGain: f32,
    pub speedOfSound: f32,
    pub worldUp: ma_vec3f,
}
#[test]
fn bindgen_test_layout_ma_spatializer_listener_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_spatializer_listener_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_spatializer_listener_config>(),
        48usize,
        concat!("Size of: ", stringify!(ma_spatializer_listener_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_spatializer_listener_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_spatializer_listener_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener_config),
        "::",
        stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapOut) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener_config),
        "::",
        stringify!(pChannelMapOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handedness) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener_config),
        "::",
        stringify!(handedness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneInnerAngleInRadians) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener_config),
        "::",
        stringify!(coneInnerAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterAngleInRadians) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener_config),
        "::",
        stringify!(coneOuterAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterGain) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener_config),
        "::",
        stringify!(coneOuterGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).speedOfSound) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener_config),
        "::",
        stringify!(speedOfSound)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).worldUp) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener_config),
        "::",
        stringify!(worldUp)
        )
    );
}
extern "C" {
    pub fn ma_spatializer_listener_config_init(
        channelsOut: ma_uint32,
    ) -> ma_spatializer_listener_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_spatializer_listener {
    pub config: ma_spatializer_listener_config,
    pub position: ma_vec3f,
    pub direction: ma_vec3f,
    pub velocity: ma_vec3f,
    pub isEnabled: ma_bool32,
    pub _ownsHeap: ma_bool32,
    pub _pHeap: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ma_spatializer_listener() {
    const UNINIT: ::std::mem::MaybeUninit<ma_spatializer_listener> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_spatializer_listener>(),
        104usize,
        concat!("Size of: ", stringify!(ma_spatializer_listener))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_spatializer_listener>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_spatializer_listener))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener),
        "::",
        stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener),
        "::",
        stringify!(position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).direction) as usize - ptr as usize },
        60usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener),
        "::",
        stringify!(direction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).velocity) as usize - ptr as usize },
        72usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener),
        "::",
        stringify!(velocity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isEnabled) as usize - ptr as usize },
        84usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener),
        "::",
        stringify!(isEnabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        88usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener),
        "::",
        stringify!(_ownsHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        96usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_listener),
        "::",
        stringify!(_pHeap)
        )
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_heap_size(
        pConfig: *const ma_spatializer_listener_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_listener_init_preallocated(
        pConfig: *const ma_spatializer_listener_config,
        pHeap: *mut ::std::os::raw::c_void,
        pListener: *mut ma_spatializer_listener,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_listener_init(
        pConfig: *const ma_spatializer_listener_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pListener: *mut ma_spatializer_listener,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_listener_uninit(
        pListener: *mut ma_spatializer_listener,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_channel_map(
        pListener: *mut ma_spatializer_listener,
    ) -> *mut ma_channel;
}
extern "C" {
    pub fn ma_spatializer_listener_set_cone(
        pListener: *mut ma_spatializer_listener,
        innerAngleInRadians: f32,
        outerAngleInRadians: f32,
        outerGain: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_cone(
        pListener: *const ma_spatializer_listener,
        pInnerAngleInRadians: *mut f32,
        pOuterAngleInRadians: *mut f32,
        pOuterGain: *mut f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_set_position(
        pListener: *mut ma_spatializer_listener,
        x: f32,
        y: f32,
        z: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_position(
        pListener: *const ma_spatializer_listener,
    ) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_listener_set_direction(
        pListener: *mut ma_spatializer_listener,
        x: f32,
        y: f32,
        z: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_direction(
        pListener: *const ma_spatializer_listener,
    ) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_listener_set_velocity(
        pListener: *mut ma_spatializer_listener,
        x: f32,
        y: f32,
        z: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_velocity(
        pListener: *const ma_spatializer_listener,
    ) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_listener_set_speed_of_sound(
        pListener: *mut ma_spatializer_listener,
        speedOfSound: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_speed_of_sound(
        pListener: *const ma_spatializer_listener,
    ) -> f32;
}
extern "C" {
    pub fn ma_spatializer_listener_set_world_up(
        pListener: *mut ma_spatializer_listener,
        x: f32,
        y: f32,
        z: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_get_world_up(
        pListener: *const ma_spatializer_listener,
    ) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_listener_set_enabled(
        pListener: *mut ma_spatializer_listener,
        isEnabled: ma_bool32,
    );
}
extern "C" {
    pub fn ma_spatializer_listener_is_enabled(
        pListener: *const ma_spatializer_listener,
    ) -> ma_bool32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_spatializer_config {
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub pChannelMapIn: *mut ma_channel,
    pub attenuationModel: ma_attenuation_model,
    pub positioning: ma_positioning,
    pub handedness: ma_handedness,
    pub minGain: f32,
    pub maxGain: f32,
    pub minDistance: f32,
    pub maxDistance: f32,
    pub rolloff: f32,
    pub coneInnerAngleInRadians: f32,
    pub coneOuterAngleInRadians: f32,
    pub coneOuterGain: f32,
    pub dopplerFactor: f32,
    pub directionalAttenuationFactor: f32,
    pub gainSmoothTimeInFrames: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_spatializer_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_spatializer_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_spatializer_config>(),
        72usize,
        concat!("Size of: ", stringify!(ma_spatializer_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_spatializer_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_spatializer_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapIn) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(pChannelMapIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attenuationModel) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(attenuationModel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).positioning) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(positioning)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handedness) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(handedness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minGain) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(minGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxGain) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(maxGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minDistance) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(minDistance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxDistance) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(maxDistance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rolloff) as usize - ptr as usize },
        44usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(rolloff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneInnerAngleInRadians) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(coneInnerAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterAngleInRadians) as usize - ptr as usize },
        52usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(coneOuterAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterGain) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(coneOuterGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dopplerFactor) as usize - ptr as usize },
        60usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(dopplerFactor)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).directionalAttenuationFactor) as usize - ptr as usize
        },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(directionalAttenuationFactor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainSmoothTimeInFrames) as usize - ptr as usize },
        68usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer_config),
        "::",
        stringify!(gainSmoothTimeInFrames)
        )
    );
}
extern "C" {
    pub fn ma_spatializer_config_init(
        channelsIn: ma_uint32,
        channelsOut: ma_uint32,
    ) -> ma_spatializer_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_spatializer {
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub pChannelMapIn: *mut ma_channel,
    pub attenuationModel: ma_attenuation_model,
    pub positioning: ma_positioning,
    pub handedness: ma_handedness,
    pub minGain: f32,
    pub maxGain: f32,
    pub minDistance: f32,
    pub maxDistance: f32,
    pub rolloff: f32,
    pub coneInnerAngleInRadians: f32,
    pub coneOuterAngleInRadians: f32,
    pub coneOuterGain: f32,
    pub dopplerFactor: f32,
    pub directionalAttenuationFactor: f32,
    pub gainSmoothTimeInFrames: ma_uint32,
    pub position: ma_vec3f,
    pub direction: ma_vec3f,
    pub velocity: ma_vec3f,
    pub dopplerPitch: f32,
    pub gainer: ma_gainer,
    pub pNewChannelGainsOut: *mut f32,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_spatializer() {
    const UNINIT: ::std::mem::MaybeUninit<ma_spatializer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_spatializer>(),
        184usize,
        concat!("Size of: ", stringify!(ma_spatializer))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_spatializer>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_spatializer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapIn) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(pChannelMapIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attenuationModel) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(attenuationModel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).positioning) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(positioning)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handedness) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(handedness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minGain) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(minGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxGain) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(maxGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minDistance) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(minDistance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxDistance) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(maxDistance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rolloff) as usize - ptr as usize },
        44usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(rolloff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneInnerAngleInRadians) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(coneInnerAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterAngleInRadians) as usize - ptr as usize },
        52usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(coneOuterAngleInRadians)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coneOuterGain) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(coneOuterGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dopplerFactor) as usize - ptr as usize },
        60usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(dopplerFactor)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).directionalAttenuationFactor) as usize - ptr as usize
        },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(directionalAttenuationFactor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainSmoothTimeInFrames) as usize - ptr as usize },
        68usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(gainSmoothTimeInFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position) as usize - ptr as usize },
        72usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).direction) as usize - ptr as usize },
        84usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(direction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).velocity) as usize - ptr as usize },
        96usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(velocity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dopplerPitch) as usize - ptr as usize },
        108usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(dopplerPitch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainer) as usize - ptr as usize },
        112usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(gainer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pNewChannelGainsOut) as usize - ptr as usize },
        160usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(pNewChannelGainsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        168usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        176usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_spatializer),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_spatializer_get_heap_size(
        pConfig: *const ma_spatializer_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_init_preallocated(
        pConfig: *const ma_spatializer_config,
        pHeap: *mut ::std::os::raw::c_void,
        pSpatializer: *mut ma_spatializer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_init(
        pConfig: *const ma_spatializer_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pSpatializer: *mut ma_spatializer,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_uninit(
        pSpatializer: *mut ma_spatializer,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_spatializer_process_pcm_frames(
        pSpatializer: *mut ma_spatializer,
        pListener: *mut ma_spatializer_listener,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_spatializer_get_input_channels(pSpatializer: *const ma_spatializer) -> ma_uint32;
}
extern "C" {
    pub fn ma_spatializer_get_output_channels(pSpatializer: *const ma_spatializer) -> ma_uint32;
}
extern "C" {
    pub fn ma_spatializer_set_attenuation_model(
        pSpatializer: *mut ma_spatializer,
        attenuationModel: ma_attenuation_model,
    );
}
extern "C" {
    pub fn ma_spatializer_get_attenuation_model(
        pSpatializer: *const ma_spatializer,
    ) -> ma_attenuation_model;
}
extern "C" {
    pub fn ma_spatializer_set_positioning(
        pSpatializer: *mut ma_spatializer,
        positioning: ma_positioning,
    );
}
extern "C" {
    pub fn ma_spatializer_get_positioning(pSpatializer: *const ma_spatializer) -> ma_positioning;
}
extern "C" {
    pub fn ma_spatializer_set_rolloff(pSpatializer: *mut ma_spatializer, rolloff: f32);
}
extern "C" {
    pub fn ma_spatializer_get_rolloff(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_min_gain(pSpatializer: *mut ma_spatializer, minGain: f32);
}
extern "C" {
    pub fn ma_spatializer_get_min_gain(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_max_gain(pSpatializer: *mut ma_spatializer, maxGain: f32);
}
extern "C" {
    pub fn ma_spatializer_get_max_gain(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_min_distance(pSpatializer: *mut ma_spatializer, minDistance: f32);
}
extern "C" {
    pub fn ma_spatializer_get_min_distance(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_max_distance(pSpatializer: *mut ma_spatializer, maxDistance: f32);
}
extern "C" {
    pub fn ma_spatializer_get_max_distance(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_cone(
        pSpatializer: *mut ma_spatializer,
        innerAngleInRadians: f32,
        outerAngleInRadians: f32,
        outerGain: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_get_cone(
        pSpatializer: *const ma_spatializer,
        pInnerAngleInRadians: *mut f32,
        pOuterAngleInRadians: *mut f32,
        pOuterGain: *mut f32,
    );
}
extern "C" {
    pub fn ma_spatializer_set_doppler_factor(pSpatializer: *mut ma_spatializer, dopplerFactor: f32);
}
extern "C" {
    pub fn ma_spatializer_get_doppler_factor(pSpatializer: *const ma_spatializer) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_directional_attenuation_factor(
        pSpatializer: *mut ma_spatializer,
        directionalAttenuationFactor: f32,
    );
}
extern "C" {
    pub fn ma_spatializer_get_directional_attenuation_factor(
        pSpatializer: *const ma_spatializer,
    ) -> f32;
}
extern "C" {
    pub fn ma_spatializer_set_position(pSpatializer: *mut ma_spatializer, x: f32, y: f32, z: f32);
}
extern "C" {
    pub fn ma_spatializer_get_position(pSpatializer: *const ma_spatializer) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_set_direction(pSpatializer: *mut ma_spatializer, x: f32, y: f32, z: f32);
}
extern "C" {
    pub fn ma_spatializer_get_direction(pSpatializer: *const ma_spatializer) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_set_velocity(pSpatializer: *mut ma_spatializer, x: f32, y: f32, z: f32);
}
extern "C" {
    pub fn ma_spatializer_get_velocity(pSpatializer: *const ma_spatializer) -> ma_vec3f;
}
extern "C" {
    pub fn ma_spatializer_get_relative_position_and_direction(
        pSpatializer: *const ma_spatializer,
        pListener: *const ma_spatializer_listener,
        pRelativePos: *mut ma_vec3f,
        pRelativeDir: *mut ma_vec3f,
    );
}
#[doc = "Resampling"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_linear_resampler_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub lpfOrder: ma_uint32,
    pub lpfNyquistFactor: f64,
}
#[test]
fn bindgen_test_layout_ma_linear_resampler_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_linear_resampler_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_linear_resampler_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_linear_resampler_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler_config),
        "::",
        stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler_config),
        "::",
        stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpfOrder) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler_config),
        "::",
        stringify!(lpfOrder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpfNyquistFactor) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler_config),
        "::",
        stringify!(lpfNyquistFactor)
        )
    );
}
extern "C" {
    pub fn ma_linear_resampler_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_linear_resampler_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_linear_resampler {
    pub config: ma_linear_resampler_config,
    pub inAdvanceInt: ma_uint32,
    pub inAdvanceFrac: ma_uint32,
    pub inTimeInt: ma_uint32,
    pub inTimeFrac: ma_uint32,
    pub x0: ma_linear_resampler__bindgen_ty_1,
    pub x1: ma_linear_resampler__bindgen_ty_2,
    pub lpf: ma_lpf,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_linear_resampler__bindgen_ty_1 {
    pub f32_: *mut f32,
    pub s16: *mut ma_int16,
}
#[test]
fn bindgen_test_layout_ma_linear_resampler__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_linear_resampler__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ma_linear_resampler__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler__bindgen_ty_1>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_linear_resampler__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler__bindgen_ty_1),
        "::",
        stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s16) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler__bindgen_ty_1),
        "::",
        stringify!(s16)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_linear_resampler__bindgen_ty_2 {
    pub f32_: *mut f32,
    pub s16: *mut ma_int16,
}
#[test]
fn bindgen_test_layout_ma_linear_resampler__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_linear_resampler__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(ma_linear_resampler__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler__bindgen_ty_2>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_linear_resampler__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler__bindgen_ty_2),
        "::",
        stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s16) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler__bindgen_ty_2),
        "::",
        stringify!(s16)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_linear_resampler() {
    const UNINIT: ::std::mem::MaybeUninit<ma_linear_resampler> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler>(),
        136usize,
        concat!("Size of: ", stringify!(ma_linear_resampler))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_linear_resampler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler),
        "::",
        stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inAdvanceInt) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler),
        "::",
        stringify!(inAdvanceInt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inAdvanceFrac) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler),
        "::",
        stringify!(inAdvanceFrac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inTimeInt) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler),
        "::",
        stringify!(inTimeInt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inTimeFrac) as usize - ptr as usize },
        44usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler),
        "::",
        stringify!(inTimeFrac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x0) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler),
        "::",
        stringify!(x0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x1) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler),
        "::",
        stringify!(x1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpf) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler),
        "::",
        stringify!(lpf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        120usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        128usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_linear_resampler),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_linear_resampler_get_heap_size(
        pConfig: *const ma_linear_resampler_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_init_preallocated(
        pConfig: *const ma_linear_resampler_config,
        pHeap: *mut ::std::os::raw::c_void,
        pResampler: *mut ma_linear_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_init(
        pConfig: *const ma_linear_resampler_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pResampler: *mut ma_linear_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_uninit(
        pResampler: *mut ma_linear_resampler,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_linear_resampler_process_pcm_frames(
        pResampler: *mut ma_linear_resampler,
        pFramesIn: *const ::std::os::raw::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_set_rate(
        pResampler: *mut ma_linear_resampler,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_set_rate_ratio(
        pResampler: *mut ma_linear_resampler,
        ratioInOut: f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_get_input_latency(
        pResampler: *const ma_linear_resampler,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_linear_resampler_get_output_latency(
        pResampler: *const ma_linear_resampler,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_linear_resampler_get_required_input_frame_count(
        pResampler: *const ma_linear_resampler,
        outputFrameCount: ma_uint64,
        pInputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_get_expected_output_frame_count(
        pResampler: *const ma_linear_resampler,
        inputFrameCount: ma_uint64,
        pOutputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_reset(pResampler: *mut ma_linear_resampler) -> ma_result;
}
pub type ma_resampling_backend = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_resampling_backend_vtable {
    pub onGetHeapSize: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pConfig: *const ma_resampler_config,
            pHeapSizeInBytes: *mut usize,
        ) -> ma_result,
    >,
    pub onInit: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pConfig: *const ma_resampler_config,
            pHeap: *mut ::std::os::raw::c_void,
            ppBackend: *mut *mut ma_resampling_backend,
        ) -> ma_result,
    >,
    pub onUninit: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *mut ma_resampling_backend,
            pAllocationCallbacks: *const ma_allocation_callbacks,
        ),
    >,
    pub onProcess: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *mut ma_resampling_backend,
            pFramesIn: *const ::std::os::raw::c_void,
            pFrameCountIn: *mut ma_uint64,
            pFramesOut: *mut ::std::os::raw::c_void,
            pFrameCountOut: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onSetRate: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *mut ma_resampling_backend,
            sampleRateIn: ma_uint32,
            sampleRateOut: ma_uint32,
        ) -> ma_result,
    >,
    pub onGetInputLatency: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *const ma_resampling_backend,
        ) -> ma_uint64,
    >,
    pub onGetOutputLatency: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *const ma_resampling_backend,
        ) -> ma_uint64,
    >,
    pub onGetRequiredInputFrameCount: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *const ma_resampling_backend,
            outputFrameCount: ma_uint64,
            pInputFrameCount: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onGetExpectedOutputFrameCount: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *const ma_resampling_backend,
            inputFrameCount: ma_uint64,
            pOutputFrameCount: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onReset: ::std::option::Option<
        unsafe extern "C" fn(
            pUserData: *mut ::std::os::raw::c_void,
            pBackend: *mut ma_resampling_backend,
        ) -> ma_result,
    >,
}
#[test]
fn bindgen_test_layout_ma_resampling_backend_vtable() {
    const UNINIT: ::std::mem::MaybeUninit<ma_resampling_backend_vtable> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_resampling_backend_vtable>(),
        80usize,
        concat!("Size of: ", stringify!(ma_resampling_backend_vtable))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampling_backend_vtable>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampling_backend_vtable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onGetHeapSize) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampling_backend_vtable),
        "::",
        stringify!(onGetHeapSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onInit) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampling_backend_vtable),
        "::",
        stringify!(onInit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onUninit) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampling_backend_vtable),
        "::",
        stringify!(onUninit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onProcess) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampling_backend_vtable),
        "::",
        stringify!(onProcess)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onSetRate) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampling_backend_vtable),
        "::",
        stringify!(onSetRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onGetInputLatency) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampling_backend_vtable),
        "::",
        stringify!(onGetInputLatency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onGetOutputLatency) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampling_backend_vtable),
        "::",
        stringify!(onGetOutputLatency)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).onGetRequiredInputFrameCount) as usize - ptr as usize
        },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampling_backend_vtable),
        "::",
        stringify!(onGetRequiredInputFrameCount)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).onGetExpectedOutputFrameCount) as usize - ptr as usize
        },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampling_backend_vtable),
        "::",
        stringify!(onGetExpectedOutputFrameCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onReset) as usize - ptr as usize },
        72usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampling_backend_vtable),
        "::",
        stringify!(onReset)
        )
    );
}
pub const ma_resample_algorithm_ma_resample_algorithm_linear: ma_resample_algorithm = 0;
pub const ma_resample_algorithm_ma_resample_algorithm_custom: ma_resample_algorithm = 1;
pub type ma_resample_algorithm = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_resampler_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub algorithm: ma_resample_algorithm,
    pub pBackendVTable: *mut ma_resampling_backend_vtable,
    pub pBackendUserData: *mut ::std::os::raw::c_void,
    pub linear: ma_resampler_config__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_resampler_config__bindgen_ty_1 {
    pub lpfOrder: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_resampler_config__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_resampler_config__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_resampler_config__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ma_resampler_config__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler_config__bindgen_ty_1>(),
        4usize,
        concat!(
        "Alignment of ",
        stringify!(ma_resampler_config__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpfOrder) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler_config__bindgen_ty_1),
        "::",
        stringify!(lpfOrder)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_resampler_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_resampler_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_resampler_config>(),
        48usize,
        concat!("Size of: ", stringify!(ma_resampler_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler_config),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler_config),
        "::",
        stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler_config),
        "::",
        stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).algorithm) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler_config),
        "::",
        stringify!(algorithm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBackendVTable) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler_config),
        "::",
        stringify!(pBackendVTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBackendUserData) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler_config),
        "::",
        stringify!(pBackendUserData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linear) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler_config),
        "::",
        stringify!(linear)
        )
    );
}
extern "C" {
    pub fn ma_resampler_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
        algorithm: ma_resample_algorithm,
    ) -> ma_resampler_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_resampler {
    pub pBackend: *mut ma_resampling_backend,
    pub pBackendVTable: *mut ma_resampling_backend_vtable,
    pub pBackendUserData: *mut ::std::os::raw::c_void,
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub state: ma_resampler__bindgen_ty_1,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_resampler__bindgen_ty_1 {
    pub linear: ma_linear_resampler,
}
#[test]
fn bindgen_test_layout_ma_resampler__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_resampler__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_resampler__bindgen_ty_1>(),
        136usize,
        concat!("Size of: ", stringify!(ma_resampler__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linear) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler__bindgen_ty_1),
        "::",
        stringify!(linear)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_resampler() {
    const UNINIT: ::std::mem::MaybeUninit<ma_resampler> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_resampler>(),
        192usize,
        concat!("Size of: ", stringify!(ma_resampler))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBackend) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler),
        "::",
        stringify!(pBackend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBackendVTable) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler),
        "::",
        stringify!(pBackendVTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBackendUserData) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler),
        "::",
        stringify!(pBackendUserData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler),
        "::",
        stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler),
        "::",
        stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler),
        "::",
        stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        176usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        184usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_resampler),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_resampler_get_heap_size(
        pConfig: *const ma_resampler_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_init_preallocated(
        pConfig: *const ma_resampler_config,
        pHeap: *mut ::std::os::raw::c_void,
        pResampler: *mut ma_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_init(
        pConfig: *const ma_resampler_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pResampler: *mut ma_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_uninit(
        pResampler: *mut ma_resampler,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_resampler_process_pcm_frames(
        pResampler: *mut ma_resampler,
        pFramesIn: *const ::std::os::raw::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_set_rate(
        pResampler: *mut ma_resampler,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_set_rate_ratio(pResampler: *mut ma_resampler, ratio: f32) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_get_input_latency(pResampler: *const ma_resampler) -> ma_uint64;
}
extern "C" {
    pub fn ma_resampler_get_output_latency(pResampler: *const ma_resampler) -> ma_uint64;
}
extern "C" {
    pub fn ma_resampler_get_required_input_frame_count(
        pResampler: *const ma_resampler,
        outputFrameCount: ma_uint64,
        pInputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_get_expected_output_frame_count(
        pResampler: *const ma_resampler,
        inputFrameCount: ma_uint64,
        pOutputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_reset(pResampler: *mut ma_resampler) -> ma_result;
}
pub const ma_channel_conversion_path_ma_channel_conversion_path_unknown:
ma_channel_conversion_path = 0;
pub const ma_channel_conversion_path_ma_channel_conversion_path_passthrough:
ma_channel_conversion_path = 1;
pub const ma_channel_conversion_path_ma_channel_conversion_path_mono_out:
ma_channel_conversion_path = 2;
pub const ma_channel_conversion_path_ma_channel_conversion_path_mono_in:
ma_channel_conversion_path = 3;
pub const ma_channel_conversion_path_ma_channel_conversion_path_shuffle:
ma_channel_conversion_path = 4;
pub const ma_channel_conversion_path_ma_channel_conversion_path_weights:
ma_channel_conversion_path = 5;
#[doc = "Channel Conversion"]
pub type ma_channel_conversion_path = ::std::os::raw::c_int;
pub const ma_mono_expansion_mode_ma_mono_expansion_mode_duplicate: ma_mono_expansion_mode = 0;
pub const ma_mono_expansion_mode_ma_mono_expansion_mode_average: ma_mono_expansion_mode = 1;
pub const ma_mono_expansion_mode_ma_mono_expansion_mode_stereo_only: ma_mono_expansion_mode = 2;
pub const ma_mono_expansion_mode_ma_mono_expansion_mode_default: ma_mono_expansion_mode = 0;
pub type ma_mono_expansion_mode = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_channel_converter_config {
    pub format: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub pChannelMapIn: *const ma_channel,
    pub pChannelMapOut: *const ma_channel,
    pub mixingMode: ma_channel_mix_mode,
    pub calculateLFEFromSpatialChannels: ma_bool32,
    pub ppWeights: *mut *mut f32,
}
#[test]
fn bindgen_test_layout_ma_channel_converter_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_channel_converter_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_channel_converter_config>(),
        48usize,
        concat!("Size of: ", stringify!(ma_channel_converter_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_channel_converter_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_channel_converter_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter_config),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter_config),
        "::",
        stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter_config),
        "::",
        stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapIn) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter_config),
        "::",
        stringify!(pChannelMapIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapOut) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter_config),
        "::",
        stringify!(pChannelMapOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mixingMode) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter_config),
        "::",
        stringify!(mixingMode)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).calculateLFEFromSpatialChannels) as usize - ptr as usize
        },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter_config),
        "::",
        stringify!(calculateLFEFromSpatialChannels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ppWeights) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter_config),
        "::",
        stringify!(ppWeights)
        )
    );
}
extern "C" {
    pub fn ma_channel_converter_config_init(
        format: ma_format,
        channelsIn: ma_uint32,
        pChannelMapIn: *const ma_channel,
        channelsOut: ma_uint32,
        pChannelMapOut: *const ma_channel,
        mixingMode: ma_channel_mix_mode,
    ) -> ma_channel_converter_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_channel_converter {
    pub format: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub mixingMode: ma_channel_mix_mode,
    pub conversionPath: ma_channel_conversion_path,
    pub pChannelMapIn: *mut ma_channel,
    pub pChannelMapOut: *mut ma_channel,
    pub pShuffleTable: *mut ma_uint8,
    pub weights: ma_channel_converter__bindgen_ty_1,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_channel_converter__bindgen_ty_1 {
    pub f32_: *mut *mut f32,
    pub s16: *mut *mut ma_int32,
}
#[test]
fn bindgen_test_layout_ma_channel_converter__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_channel_converter__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_channel_converter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ma_channel_converter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_channel_converter__bindgen_ty_1>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_channel_converter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter__bindgen_ty_1),
        "::",
        stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s16) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter__bindgen_ty_1),
        "::",
        stringify!(s16)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_channel_converter() {
    const UNINIT: ::std::mem::MaybeUninit<ma_channel_converter> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_channel_converter>(),
        72usize,
        concat!("Size of: ", stringify!(ma_channel_converter))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_channel_converter>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_channel_converter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter),
        "::",
        stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter),
        "::",
        stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mixingMode) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter),
        "::",
        stringify!(mixingMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conversionPath) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter),
        "::",
        stringify!(conversionPath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapIn) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter),
        "::",
        stringify!(pChannelMapIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapOut) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter),
        "::",
        stringify!(pChannelMapOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pShuffleTable) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter),
        "::",
        stringify!(pShuffleTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).weights) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter),
        "::",
        stringify!(weights)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_channel_converter),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_channel_converter_get_heap_size(
        pConfig: *const ma_channel_converter_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_init_preallocated(
        pConfig: *const ma_channel_converter_config,
        pHeap: *mut ::std::os::raw::c_void,
        pConverter: *mut ma_channel_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_init(
        pConfig: *const ma_channel_converter_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pConverter: *mut ma_channel_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_uninit(
        pConverter: *mut ma_channel_converter,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_channel_converter_process_pcm_frames(
        pConverter: *mut ma_channel_converter,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_get_input_channel_map(
        pConverter: *const ma_channel_converter,
        pChannelMap: *mut ma_channel,
        channelMapCap: usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_get_output_channel_map(
        pConverter: *const ma_channel_converter,
        pChannelMap: *mut ma_channel,
        channelMapCap: usize,
    ) -> ma_result;
}
#[doc = "Data Conversion"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_data_converter_config {
    pub formatIn: ma_format,
    pub formatOut: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub pChannelMapIn: *mut ma_channel,
    pub pChannelMapOut: *mut ma_channel,
    pub ditherMode: ma_dither_mode,
    pub channelMixMode: ma_channel_mix_mode,
    pub calculateLFEFromSpatialChannels: ma_bool32,
    pub ppChannelWeights: *mut *mut f32,
    pub allowDynamicSampleRate: ma_bool32,
    pub resampling: ma_resampler_config,
}
#[test]
fn bindgen_test_layout_ma_data_converter_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_data_converter_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_data_converter_config>(),
        120usize,
        concat!("Size of: ", stringify!(ma_data_converter_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_converter_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_converter_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formatIn) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(formatIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formatOut) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(formatOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapIn) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(pChannelMapIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pChannelMapOut) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(pChannelMapOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ditherMode) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(ditherMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelMixMode) as usize - ptr as usize },
        44usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(channelMixMode)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).calculateLFEFromSpatialChannels) as usize - ptr as usize
        },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(calculateLFEFromSpatialChannels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ppChannelWeights) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(ppChannelWeights)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allowDynamicSampleRate) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(allowDynamicSampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resampling) as usize - ptr as usize },
        72usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter_config),
        "::",
        stringify!(resampling)
        )
    );
}
extern "C" {
    pub fn ma_data_converter_config_init_default() -> ma_data_converter_config;
}
extern "C" {
    pub fn ma_data_converter_config_init(
        formatIn: ma_format,
        formatOut: ma_format,
        channelsIn: ma_uint32,
        channelsOut: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_data_converter_config;
}
pub const ma_data_converter_execution_path_ma_data_converter_execution_path_passthrough:
ma_data_converter_execution_path = 0;
pub const ma_data_converter_execution_path_ma_data_converter_execution_path_format_only:
ma_data_converter_execution_path = 1;
pub const ma_data_converter_execution_path_ma_data_converter_execution_path_channels_only:
ma_data_converter_execution_path = 2;
pub const ma_data_converter_execution_path_ma_data_converter_execution_path_resample_only:
ma_data_converter_execution_path = 3;
pub const ma_data_converter_execution_path_ma_data_converter_execution_path_resample_first:
ma_data_converter_execution_path = 4;
pub const ma_data_converter_execution_path_ma_data_converter_execution_path_channels_first:
ma_data_converter_execution_path = 5;
pub type ma_data_converter_execution_path = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_data_converter {
    pub formatIn: ma_format,
    pub formatOut: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub ditherMode: ma_dither_mode,
    pub executionPath: ma_data_converter_execution_path,
    pub channelConverter: ma_channel_converter,
    pub resampler: ma_resampler,
    pub hasPreFormatConversion: ma_bool8,
    pub hasPostFormatConversion: ma_bool8,
    pub hasChannelConverter: ma_bool8,
    pub hasResampler: ma_bool8,
    pub isPassthrough: ma_bool8,
    pub _ownsHeap: ma_bool8,
    pub _pHeap: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ma_data_converter() {
    const UNINIT: ::std::mem::MaybeUninit<ma_data_converter> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_data_converter>(),
        312usize,
        concat!("Size of: ", stringify!(ma_data_converter))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_converter>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_converter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formatIn) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(formatIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formatOut) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(formatOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ditherMode) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(ditherMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).executionPath) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(executionPath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelConverter) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(channelConverter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resampler) as usize - ptr as usize },
        104usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(resampler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasPreFormatConversion) as usize - ptr as usize },
        296usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(hasPreFormatConversion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasPostFormatConversion) as usize - ptr as usize },
        297usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(hasPostFormatConversion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasChannelConverter) as usize - ptr as usize },
        298usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(hasChannelConverter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasResampler) as usize - ptr as usize },
        299usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(hasResampler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isPassthrough) as usize - ptr as usize },
        300usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(isPassthrough)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        301usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(_ownsHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        304usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_data_converter),
        "::",
        stringify!(_pHeap)
        )
    );
}
extern "C" {
    pub fn ma_data_converter_get_heap_size(
        pConfig: *const ma_data_converter_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_init_preallocated(
        pConfig: *const ma_data_converter_config,
        pHeap: *mut ::std::os::raw::c_void,
        pConverter: *mut ma_data_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_init(
        pConfig: *const ma_data_converter_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pConverter: *mut ma_data_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_uninit(
        pConverter: *mut ma_data_converter,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_data_converter_process_pcm_frames(
        pConverter: *mut ma_data_converter,
        pFramesIn: *const ::std::os::raw::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_set_rate(
        pConverter: *mut ma_data_converter,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_set_rate_ratio(
        pConverter: *mut ma_data_converter,
        ratioInOut: f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_get_input_latency(pConverter: *const ma_data_converter) -> ma_uint64;
}
extern "C" {
    pub fn ma_data_converter_get_output_latency(pConverter: *const ma_data_converter) -> ma_uint64;
}
extern "C" {
    pub fn ma_data_converter_get_required_input_frame_count(
        pConverter: *const ma_data_converter,
        outputFrameCount: ma_uint64,
        pInputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_get_expected_output_frame_count(
        pConverter: *const ma_data_converter,
        inputFrameCount: ma_uint64,
        pOutputFrameCount: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_get_input_channel_map(
        pConverter: *const ma_data_converter,
        pChannelMap: *mut ma_channel,
        channelMapCap: usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_get_output_channel_map(
        pConverter: *const ma_data_converter,
        pChannelMap: *mut ma_channel,
        channelMapCap: usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_reset(pConverter: *mut ma_data_converter) -> ma_result;
}
extern "C" {
    #[doc = "Format Conversion"]
    pub fn ma_pcm_u8_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_convert(
        pOut: *mut ::std::os::raw::c_void,
        formatOut: ma_format,
        pIn: *const ::std::os::raw::c_void,
        formatIn: ma_format,
        sampleCount: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_convert_pcm_frames_format(
        pOut: *mut ::std::os::raw::c_void,
        formatOut: ma_format,
        pIn: *const ::std::os::raw::c_void,
        formatIn: ma_format,
        frameCount: ma_uint64,
        channels: ma_uint32,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_deinterleave_pcm_frames(
        format: ma_format,
        channels: ma_uint32,
        frameCount: ma_uint64,
        pInterleavedPCMFrames: *const ::std::os::raw::c_void,
        ppDeinterleavedPCMFrames: *mut *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn ma_interleave_pcm_frames(
        format: ma_format,
        channels: ma_uint32,
        frameCount: ma_uint64,
        ppDeinterleavedPCMFrames: *mut *const ::std::os::raw::c_void,
        pInterleavedPCMFrames: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn ma_channel_map_get_channel(
        pChannelMap: *const ma_channel,
        channelCount: ma_uint32,
        channelIndex: ma_uint32,
    ) -> ma_channel;
}
extern "C" {
    pub fn ma_channel_map_init_blank(pChannelMap: *mut ma_channel, channels: ma_uint32);
}
extern "C" {
    pub fn ma_channel_map_init_standard(
        standardChannelMap: ma_standard_channel_map,
        pChannelMap: *mut ma_channel,
        channelMapCap: usize,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_channel_map_copy(pOut: *mut ma_channel, pIn: *const ma_channel, channels: ma_uint32);
}
extern "C" {
    pub fn ma_channel_map_copy_or_default(
        pOut: *mut ma_channel,
        channelMapCapOut: usize,
        pIn: *const ma_channel,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_channel_map_is_valid(
        pChannelMap: *const ma_channel,
        channels: ma_uint32,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_is_equal(
        pChannelMapA: *const ma_channel,
        pChannelMapB: *const ma_channel,
        channels: ma_uint32,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_is_blank(
        pChannelMap: *const ma_channel,
        channels: ma_uint32,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_contains_channel_position(
        channels: ma_uint32,
        pChannelMap: *const ma_channel,
        channelPosition: ma_channel,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_find_channel_position(
        channels: ma_uint32,
        pChannelMap: *const ma_channel,
        channelPosition: ma_channel,
        pChannelIndex: *mut ma_uint32,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_to_string(
        pChannelMap: *const ma_channel,
        channels: ma_uint32,
        pBufferOut: *mut ::std::os::raw::c_char,
        bufferCap: usize,
    ) -> usize;
}
extern "C" {
    pub fn ma_channel_position_to_string(channel: ma_channel) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Conversion Helpers"]
    pub fn ma_convert_frames(
        pOut: *mut ::std::os::raw::c_void,
        frameCountOut: ma_uint64,
        formatOut: ma_format,
        channelsOut: ma_uint32,
        sampleRateOut: ma_uint32,
        pIn: *const ::std::os::raw::c_void,
        frameCountIn: ma_uint64,
        formatIn: ma_format,
        channelsIn: ma_uint32,
        sampleRateIn: ma_uint32,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_convert_frames_ex(
        pOut: *mut ::std::os::raw::c_void,
        frameCountOut: ma_uint64,
        pIn: *const ::std::os::raw::c_void,
        frameCountIn: ma_uint64,
        pConfig: *const ma_data_converter_config,
    ) -> ma_uint64;
}
#[doc = "Ring Buffer"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_rb {
    pub pBuffer: *mut ::std::os::raw::c_void,
    pub subbufferSizeInBytes: ma_uint32,
    pub subbufferCount: ma_uint32,
    pub subbufferStrideInBytes: ma_uint32,
    pub encodedReadOffset: ma_uint32,
    pub encodedWriteOffset: ma_uint32,
    pub ownsBuffer: ma_bool8,
    pub clearOnWriteAcquire: ma_bool8,
    pub allocationCallbacks: ma_allocation_callbacks,
}
#[test]
fn bindgen_test_layout_ma_rb() {
    const UNINIT: ::std::mem::MaybeUninit<ma_rb> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_rb>(),
        64usize,
        concat!("Size of: ", stringify!(ma_rb))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_rb))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBuffer) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_rb),
        "::",
        stringify!(pBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subbufferSizeInBytes) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_rb),
        "::",
        stringify!(subbufferSizeInBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subbufferCount) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_rb),
        "::",
        stringify!(subbufferCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subbufferStrideInBytes) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_rb),
        "::",
        stringify!(subbufferStrideInBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encodedReadOffset) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_rb),
        "::",
        stringify!(encodedReadOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encodedWriteOffset) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_rb),
        "::",
        stringify!(encodedWriteOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ownsBuffer) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_rb),
        "::",
        stringify!(ownsBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clearOnWriteAcquire) as usize - ptr as usize },
        29usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_rb),
        "::",
        stringify!(clearOnWriteAcquire)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocationCallbacks) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_rb),
        "::",
        stringify!(allocationCallbacks)
        )
    );
}
extern "C" {
    pub fn ma_rb_init_ex(
        subbufferSizeInBytes: usize,
        subbufferCount: usize,
        subbufferStrideInBytes: usize,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_init(
        bufferSizeInBytes: usize,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_uninit(pRB: *mut ma_rb);
}
extern "C" {
    pub fn ma_rb_reset(pRB: *mut ma_rb);
}
extern "C" {
    pub fn ma_rb_acquire_read(
        pRB: *mut ma_rb,
        pSizeInBytes: *mut usize,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_commit_read(pRB: *mut ma_rb, sizeInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_acquire_write(
        pRB: *mut ma_rb,
        pSizeInBytes: *mut usize,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_commit_write(pRB: *mut ma_rb, sizeInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_seek_read(pRB: *mut ma_rb, offsetInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_seek_write(pRB: *mut ma_rb, offsetInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_pointer_distance(pRB: *mut ma_rb) -> ma_int32;
}
extern "C" {
    pub fn ma_rb_available_read(pRB: *mut ma_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_rb_available_write(pRB: *mut ma_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_size(pRB: *mut ma_rb) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_stride(pRB: *mut ma_rb) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_offset(pRB: *mut ma_rb, subbufferIndex: usize) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_ptr(
        pRB: *mut ma_rb,
        subbufferIndex: usize,
        pBuffer: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_pcm_rb {
    pub rb: ma_rb,
    pub format: ma_format,
    pub channels: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_pcm_rb() {
    const UNINIT: ::std::mem::MaybeUninit<ma_pcm_rb> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_pcm_rb>(),
        72usize,
        concat!("Size of: ", stringify!(ma_pcm_rb))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_pcm_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_pcm_rb))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rb) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_pcm_rb),
        "::",
        stringify!(rb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_pcm_rb),
        "::",
        stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        68usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_pcm_rb),
        "::",
        stringify!(channels)
        )
    );
}
extern "C" {
    pub fn ma_pcm_rb_init_ex(
        format: ma_format,
        channels: ma_uint32,
        subbufferSizeInFrames: ma_uint32,
        subbufferCount: ma_uint32,
        subbufferStrideInFrames: ma_uint32,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_pcm_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_init(
        format: ma_format,
        channels: ma_uint32,
        bufferSizeInFrames: ma_uint32,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_pcm_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_uninit(pRB: *mut ma_pcm_rb);
}
extern "C" {
    pub fn ma_pcm_rb_reset(pRB: *mut ma_pcm_rb);
}
extern "C" {
    pub fn ma_pcm_rb_acquire_read(
        pRB: *mut ma_pcm_rb,
        pSizeInFrames: *mut ma_uint32,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_commit_read(pRB: *mut ma_pcm_rb, sizeInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_acquire_write(
        pRB: *mut ma_pcm_rb,
        pSizeInFrames: *mut ma_uint32,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_commit_write(pRB: *mut ma_pcm_rb, sizeInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_seek_read(pRB: *mut ma_pcm_rb, offsetInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_seek_write(pRB: *mut ma_pcm_rb, offsetInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_pointer_distance(pRB: *mut ma_pcm_rb) -> ma_int32;
}
extern "C" {
    pub fn ma_pcm_rb_available_read(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_available_write(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_size(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_stride(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_offset(
        pRB: *mut ma_pcm_rb,
        subbufferIndex: ma_uint32,
    ) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_ptr(
        pRB: *mut ma_pcm_rb,
        subbufferIndex: ma_uint32,
        pBuffer: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_duplex_rb {
    pub rb: ma_pcm_rb,
}
#[test]
fn bindgen_test_layout_ma_duplex_rb() {
    const UNINIT: ::std::mem::MaybeUninit<ma_duplex_rb> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_duplex_rb>(),
        72usize,
        concat!("Size of: ", stringify!(ma_duplex_rb))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_duplex_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_duplex_rb))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rb) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_duplex_rb),
        "::",
        stringify!(rb)
        )
    );
}
extern "C" {
    pub fn ma_duplex_rb_init(
        captureFormat: ma_format,
        captureChannels: ma_uint32,
        sampleRate: ma_uint32,
        captureInternalSampleRate: ma_uint32,
        captureInternalPeriodSizeInFrames: ma_uint32,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_duplex_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_duplex_rb_uninit(pRB: *mut ma_duplex_rb) -> ma_result;
}
extern "C" {
    #[doc = "Miscellaneous Helpers"]
    pub fn ma_result_description(result: ma_result) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ma_malloc(
        sz: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_calloc(
        sz: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_realloc(
        p: *mut ::std::os::raw::c_void,
        sz: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_free(
        p: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_aligned_malloc(
        sz: usize,
        alignment: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_aligned_free(
        p: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_get_format_name(format: ma_format) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ma_blend_f32(
        pOut: *mut f32,
        pInA: *mut f32,
        pInB: *mut f32,
        factor: f32,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_get_bytes_per_sample(format: ma_format) -> ma_uint32;
}
extern "C" {
    pub fn ma_log_level_to_string(logLevel: ma_uint32) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Synchronization"]
    pub fn ma_spinlock_lock(pSpinlock: *mut ma_spinlock) -> ma_result;
}
extern "C" {
    pub fn ma_spinlock_lock_noyield(pSpinlock: *mut ma_spinlock) -> ma_result;
}
extern "C" {
    pub fn ma_spinlock_unlock(pSpinlock: *mut ma_spinlock) -> ma_result;
}
extern "C" {
    pub fn ma_mutex_init(pMutex: *mut ma_mutex) -> ma_result;
}
extern "C" {
    pub fn ma_mutex_uninit(pMutex: *mut ma_mutex);
}
extern "C" {
    pub fn ma_mutex_lock(pMutex: *mut ma_mutex);
}
extern "C" {
    pub fn ma_mutex_unlock(pMutex: *mut ma_mutex);
}
extern "C" {
    pub fn ma_event_init(pEvent: *mut ma_event) -> ma_result;
}
extern "C" {
    pub fn ma_event_uninit(pEvent: *mut ma_event);
}
extern "C" {
    pub fn ma_event_wait(pEvent: *mut ma_event) -> ma_result;
}
extern "C" {
    pub fn ma_event_signal(pEvent: *mut ma_event) -> ma_result;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_fence {
    pub e: ma_event,
    pub counter: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_fence() {
    const UNINIT: ::std::mem::MaybeUninit<ma_fence> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_fence>(),
        16usize,
        concat!("Size of: ", stringify!(ma_fence))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_fence>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_fence))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_fence),
        "::",
        stringify!(e)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counter) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_fence),
        "::",
        stringify!(counter)
        )
    );
}
extern "C" {
    pub fn ma_fence_init(pFence: *mut ma_fence) -> ma_result;
}
extern "C" {
    pub fn ma_fence_uninit(pFence: *mut ma_fence);
}
extern "C" {
    pub fn ma_fence_acquire(pFence: *mut ma_fence) -> ma_result;
}
extern "C" {
    pub fn ma_fence_release(pFence: *mut ma_fence) -> ma_result;
}
extern "C" {
    pub fn ma_fence_wait(pFence: *mut ma_fence) -> ma_result;
}
pub type ma_async_notification = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_async_notification_callbacks {
    pub onSignal:
    ::std::option::Option<unsafe extern "C" fn(pNotification: *mut ma_async_notification)>,
}
#[test]
fn bindgen_test_layout_ma_async_notification_callbacks() {
    const UNINIT: ::std::mem::MaybeUninit<ma_async_notification_callbacks> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_async_notification_callbacks>(),
        8usize,
        concat!("Size of: ", stringify!(ma_async_notification_callbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_async_notification_callbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_async_notification_callbacks))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onSignal) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_async_notification_callbacks),
        "::",
        stringify!(onSignal)
        )
    );
}
extern "C" {
    pub fn ma_async_notification_signal(pNotification: *mut ma_async_notification) -> ma_result;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_async_notification_poll {
    pub cb: ma_async_notification_callbacks,
    pub signalled: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_async_notification_poll() {
    const UNINIT: ::std::mem::MaybeUninit<ma_async_notification_poll> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_async_notification_poll>(),
        16usize,
        concat!("Size of: ", stringify!(ma_async_notification_poll))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_async_notification_poll>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_async_notification_poll))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cb) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_async_notification_poll),
        "::",
        stringify!(cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).signalled) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_async_notification_poll),
        "::",
        stringify!(signalled)
        )
    );
}
extern "C" {
    pub fn ma_async_notification_poll_init(
        pNotificationPoll: *mut ma_async_notification_poll,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_async_notification_poll_is_signalled(
        pNotificationPoll: *const ma_async_notification_poll,
    ) -> ma_bool32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_async_notification_event {
    pub cb: ma_async_notification_callbacks,
    pub e: ma_event,
}
#[test]
fn bindgen_test_layout_ma_async_notification_event() {
    const UNINIT: ::std::mem::MaybeUninit<ma_async_notification_event> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_async_notification_event>(),
        16usize,
        concat!("Size of: ", stringify!(ma_async_notification_event))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_async_notification_event>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_async_notification_event))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cb) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_async_notification_event),
        "::",
        stringify!(cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_async_notification_event),
        "::",
        stringify!(e)
        )
    );
}
extern "C" {
    pub fn ma_async_notification_event_init(
        pNotificationEvent: *mut ma_async_notification_event,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_async_notification_event_uninit(
        pNotificationEvent: *mut ma_async_notification_event,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_async_notification_event_wait(
        pNotificationEvent: *mut ma_async_notification_event,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_async_notification_event_signal(
        pNotificationEvent: *mut ma_async_notification_event,
    ) -> ma_result;
}
#[doc = "Job Queue"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_slot_allocator_config {
    pub capacity: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_slot_allocator_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_slot_allocator_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_slot_allocator_config>(),
        4usize,
        concat!("Size of: ", stringify!(ma_slot_allocator_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_slot_allocator_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_slot_allocator_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_slot_allocator_config),
        "::",
        stringify!(capacity)
        )
    );
}
extern "C" {
    pub fn ma_slot_allocator_config_init(capacity: ma_uint32) -> ma_slot_allocator_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_slot_allocator_group {
    pub bitfield: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_slot_allocator_group() {
    const UNINIT: ::std::mem::MaybeUninit<ma_slot_allocator_group> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_slot_allocator_group>(),
        4usize,
        concat!("Size of: ", stringify!(ma_slot_allocator_group))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_slot_allocator_group>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_slot_allocator_group))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bitfield) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_slot_allocator_group),
        "::",
        stringify!(bitfield)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_slot_allocator {
    pub pGroups: *mut ma_slot_allocator_group,
    pub pSlots: *mut ma_uint32,
    pub count: ma_uint32,
    pub capacity: ma_uint32,
    pub _ownsHeap: ma_bool32,
    pub _pHeap: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ma_slot_allocator() {
    const UNINIT: ::std::mem::MaybeUninit<ma_slot_allocator> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_slot_allocator>(),
        40usize,
        concat!("Size of: ", stringify!(ma_slot_allocator))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_slot_allocator>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_slot_allocator))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pGroups) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_slot_allocator),
        "::",
        stringify!(pGroups)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pSlots) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_slot_allocator),
        "::",
        stringify!(pSlots)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_slot_allocator),
        "::",
        stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_slot_allocator),
        "::",
        stringify!(capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_slot_allocator),
        "::",
        stringify!(_ownsHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_slot_allocator),
        "::",
        stringify!(_pHeap)
        )
    );
}
extern "C" {
    pub fn ma_slot_allocator_get_heap_size(
        pConfig: *const ma_slot_allocator_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_slot_allocator_init_preallocated(
        pConfig: *const ma_slot_allocator_config,
        pHeap: *mut ::std::os::raw::c_void,
        pAllocator: *mut ma_slot_allocator,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_slot_allocator_init(
        pConfig: *const ma_slot_allocator_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pAllocator: *mut ma_slot_allocator,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_slot_allocator_uninit(
        pAllocator: *mut ma_slot_allocator,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_slot_allocator_alloc(
        pAllocator: *mut ma_slot_allocator,
        pSlot: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_slot_allocator_free(pAllocator: *mut ma_slot_allocator, slot: ma_uint64)
                                  -> ma_result;
}
pub type ma_job_proc = ::std::option::Option<unsafe extern "C" fn(pJob: *mut ma_job) -> ma_result>;
pub const ma_job_type_MA_JOB_TYPE_QUIT: ma_job_type = 0;
pub const ma_job_type_MA_JOB_TYPE_CUSTOM: ma_job_type = 1;
pub const ma_job_type_MA_JOB_TYPE_RESOURCE_MANAGER_LOAD_DATA_BUFFER_NODE: ma_job_type = 2;
pub const ma_job_type_MA_JOB_TYPE_RESOURCE_MANAGER_FREE_DATA_BUFFER_NODE: ma_job_type = 3;
pub const ma_job_type_MA_JOB_TYPE_RESOURCE_MANAGER_PAGE_DATA_BUFFER_NODE: ma_job_type = 4;
pub const ma_job_type_MA_JOB_TYPE_RESOURCE_MANAGER_LOAD_DATA_BUFFER: ma_job_type = 5;
pub const ma_job_type_MA_JOB_TYPE_RESOURCE_MANAGER_FREE_DATA_BUFFER: ma_job_type = 6;
pub const ma_job_type_MA_JOB_TYPE_RESOURCE_MANAGER_LOAD_DATA_STREAM: ma_job_type = 7;
pub const ma_job_type_MA_JOB_TYPE_RESOURCE_MANAGER_FREE_DATA_STREAM: ma_job_type = 8;
pub const ma_job_type_MA_JOB_TYPE_RESOURCE_MANAGER_PAGE_DATA_STREAM: ma_job_type = 9;
pub const ma_job_type_MA_JOB_TYPE_RESOURCE_MANAGER_SEEK_DATA_STREAM: ma_job_type = 10;
pub const ma_job_type_MA_JOB_TYPE_DEVICE_AAUDIO_REROUTE: ma_job_type = 11;
pub const ma_job_type_MA_JOB_TYPE_COUNT: ma_job_type = 12;
pub type ma_job_type = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_job {
    pub toc: ma_job__bindgen_ty_1,
    pub next: ma_uint64,
    pub order: ma_uint32,
    pub data: ma_job__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_job__bindgen_ty_1 {
    pub breakup: ma_job__bindgen_ty_1__bindgen_ty_1,
    pub allocation: ma_uint64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_1__bindgen_ty_1 {
    pub code: ma_uint16,
    pub slot: ma_uint16,
    pub refcount: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ma_job__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).code) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_1__bindgen_ty_1),
        "::",
        stringify!(code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        2usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_1__bindgen_ty_1),
        "::",
        stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refcount) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_1__bindgen_ty_1),
        "::",
        stringify!(refcount)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ma_job__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_job__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).breakup) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_1),
        "::",
        stringify!(breakup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocation) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_1),
        "::",
        stringify!(allocation)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_job__bindgen_ty_2 {
    pub custom: ma_job__bindgen_ty_2__bindgen_ty_1,
    pub resourceManager: ma_job__bindgen_ty_2__bindgen_ty_2,
    pub device: ma_job__bindgen_ty_2__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_2__bindgen_ty_1 {
    pub proc_: ma_job_proc,
    pub data0: ma_uintptr,
    pub data1: ma_uintptr,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(ma_job__bindgen_ty_2__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).proc_) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(proc_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data0) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(data0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data1) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(data1)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_job__bindgen_ty_2__bindgen_ty_2 {
    pub loadDataBufferNode: ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1,
    pub freeDataBufferNode: ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2,
    pub pageDataBufferNode: ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3,
    pub loadDataBuffer: ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4,
    pub freeDataBuffer: ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_5,
    pub loadDataStream: ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6,
    pub freeDataStream: ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_7,
    pub pageDataStream: ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_8,
    pub seekDataStream: ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_9,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1 {
    pub pResourceManager: *mut ::std::os::raw::c_void,
    pub pDataBufferNode: *mut ::std::os::raw::c_void,
    pub pFilePath: *mut ::std::os::raw::c_char,
    pub pFilePathW: *mut wchar_t,
    pub flags: ma_uint32,
    pub pInitNotification: *mut ma_async_notification,
    pub pDoneNotification: *mut ma_async_notification,
    pub pInitFence: *mut ma_fence,
    pub pDoneFence: *mut ma_fence,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1>(),
        72usize,
        concat!(
        "Size of: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pResourceManager) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(pResourceManager)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDataBufferNode) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(pDataBufferNode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pFilePath) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(pFilePath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pFilePathW) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(pFilePathW)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInitNotification) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(pInitNotification)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneNotification) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(pDoneNotification)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInitFence) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(pInitFence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneFence) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1),
        "::",
        stringify!(pDoneFence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2 {
    pub pResourceManager: *mut ::std::os::raw::c_void,
    pub pDataBufferNode: *mut ::std::os::raw::c_void,
    pub pDoneNotification: *mut ma_async_notification,
    pub pDoneFence: *mut ma_fence,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2>(),
        32usize,
        concat!(
        "Size of: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pResourceManager) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(pResourceManager)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDataBufferNode) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(pDataBufferNode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneNotification) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(pDoneNotification)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneFence) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(pDoneFence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3 {
    pub pResourceManager: *mut ::std::os::raw::c_void,
    pub pDataBufferNode: *mut ::std::os::raw::c_void,
    pub pDecoder: *mut ::std::os::raw::c_void,
    pub pDoneNotification: *mut ma_async_notification,
    pub pDoneFence: *mut ma_fence,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3>(),
        40usize,
        concat!(
        "Size of: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pResourceManager) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3),
        "::",
        stringify!(pResourceManager)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDataBufferNode) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3),
        "::",
        stringify!(pDataBufferNode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDecoder) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3),
        "::",
        stringify!(pDecoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneNotification) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3),
        "::",
        stringify!(pDoneNotification)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneFence) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_3),
        "::",
        stringify!(pDoneFence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4 {
    pub pDataBuffer: *mut ::std::os::raw::c_void,
    pub pInitNotification: *mut ma_async_notification,
    pub pDoneNotification: *mut ma_async_notification,
    pub pInitFence: *mut ma_fence,
    pub pDoneFence: *mut ma_fence,
    pub rangeBegInPCMFrames: ma_uint64,
    pub rangeEndInPCMFrames: ma_uint64,
    pub loopPointBegInPCMFrames: ma_uint64,
    pub loopPointEndInPCMFrames: ma_uint64,
    pub isLooping: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4>(),
        80usize,
        concat!(
        "Size of: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDataBuffer) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4),
        "::",
        stringify!(pDataBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInitNotification) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4),
        "::",
        stringify!(pInitNotification)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneNotification) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4),
        "::",
        stringify!(pDoneNotification)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInitFence) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4),
        "::",
        stringify!(pInitFence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneFence) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4),
        "::",
        stringify!(pDoneFence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangeBegInPCMFrames) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4),
        "::",
        stringify!(rangeBegInPCMFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangeEndInPCMFrames) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4),
        "::",
        stringify!(rangeEndInPCMFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loopPointBegInPCMFrames) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4),
        "::",
        stringify!(loopPointBegInPCMFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loopPointEndInPCMFrames) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4),
        "::",
        stringify!(loopPointEndInPCMFrames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isLooping) as usize - ptr as usize },
        72usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_4),
        "::",
        stringify!(isLooping)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_5 {
    pub pDataBuffer: *mut ::std::os::raw::c_void,
    pub pDoneNotification: *mut ma_async_notification,
    pub pDoneFence: *mut ma_fence,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_5() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_5> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_5>(),
        24usize,
        concat!(
        "Size of: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_5)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_5>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDataBuffer) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_5),
        "::",
        stringify!(pDataBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneNotification) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_5),
        "::",
        stringify!(pDoneNotification)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneFence) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_5),
        "::",
        stringify!(pDoneFence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6 {
    pub pDataStream: *mut ::std::os::raw::c_void,
    pub pFilePath: *mut ::std::os::raw::c_char,
    pub pFilePathW: *mut wchar_t,
    pub initialSeekPoint: ma_uint64,
    pub pInitNotification: *mut ma_async_notification,
    pub pInitFence: *mut ma_fence,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6>(),
        48usize,
        concat!(
        "Size of: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDataStream) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6),
        "::",
        stringify!(pDataStream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pFilePath) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6),
        "::",
        stringify!(pFilePath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pFilePathW) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6),
        "::",
        stringify!(pFilePathW)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialSeekPoint) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6),
        "::",
        stringify!(initialSeekPoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInitNotification) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6),
        "::",
        stringify!(pInitNotification)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInitFence) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_6),
        "::",
        stringify!(pInitFence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_7 {
    pub pDataStream: *mut ::std::os::raw::c_void,
    pub pDoneNotification: *mut ma_async_notification,
    pub pDoneFence: *mut ma_fence,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_7() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_7> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_7>(),
        24usize,
        concat!(
        "Size of: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_7)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_7>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDataStream) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_7),
        "::",
        stringify!(pDataStream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneNotification) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_7),
        "::",
        stringify!(pDoneNotification)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDoneFence) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_7),
        "::",
        stringify!(pDoneFence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_8 {
    pub pDataStream: *mut ::std::os::raw::c_void,
    pub pageIndex: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_8() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_8> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_8>(),
        16usize,
        concat!(
        "Size of: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_8)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_8>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDataStream) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_8),
        "::",
        stringify!(pDataStream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pageIndex) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_8),
        "::",
        stringify!(pageIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_9 {
    pub pDataStream: *mut ::std::os::raw::c_void,
    pub frameIndex: ma_uint64,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_9() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_9> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_9>(),
        16usize,
        concat!(
        "Size of: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_9)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_9>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDataStream) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_9),
        "::",
        stringify!(pDataStream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frameIndex) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2__bindgen_ty_9),
        "::",
        stringify!(frameIndex)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_2>(),
        80usize,
        concat!("Size of: ", stringify!(ma_job__bindgen_ty_2__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_2>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loadDataBufferNode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(loadDataBufferNode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freeDataBufferNode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(freeDataBufferNode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pageDataBufferNode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(pageDataBufferNode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loadDataBuffer) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(loadDataBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freeDataBuffer) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(freeDataBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loadDataStream) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(loadDataStream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freeDataStream) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(freeDataStream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pageDataStream) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(pageDataStream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seekDataStream) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_2),
        "::",
        stringify!(seekDataStream)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_job__bindgen_ty_2__bindgen_ty_3 {
    pub aaudio: ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1 {
    pub reroute: ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {
    pub pDevice: *mut ::std::os::raw::c_void,
    pub deviceType: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<
        ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
        "Size of: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDevice) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1),
        "::",
        stringify!(pDevice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deviceType) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1),
        "::",
        stringify!(deviceType)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1>(),
        16usize,
        concat!(
        "Size of: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reroute) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_3__bindgen_ty_1),
        "::",
        stringify!(reroute)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2__bindgen_ty_3>(),
        16usize,
        concat!("Size of: ", stringify!(ma_job__bindgen_ty_2__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2__bindgen_ty_3>(),
        8usize,
        concat!(
        "Alignment of ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aaudio) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2__bindgen_ty_3),
        "::",
        stringify!(aaudio)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_job__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job__bindgen_ty_2>(),
        80usize,
        concat!("Size of: ", stringify!(ma_job__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_job__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).custom) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2),
        "::",
        stringify!(custom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resourceManager) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2),
        "::",
        stringify!(resourceManager)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job__bindgen_ty_2),
        "::",
        stringify!(device)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_job() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job>(),
        104usize,
        concat!("Size of: ", stringify!(ma_job))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_job))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).toc) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job),
        "::",
        stringify!(toc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job),
        "::",
        stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job),
        "::",
        stringify!(order)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job),
        "::",
        stringify!(data)
        )
    );
}
extern "C" {
    pub fn ma_job_init(code: ma_uint16) -> ma_job;
}
extern "C" {
    pub fn ma_job_process(pJob: *mut ma_job) -> ma_result;
}
pub const ma_job_queue_flags_MA_JOB_QUEUE_FLAG_NON_BLOCKING: ma_job_queue_flags = 1;
pub type ma_job_queue_flags = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job_queue_config {
    pub flags: ma_uint32,
    pub capacity: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_job_queue_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job_queue_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job_queue_config>(),
        8usize,
        concat!("Size of: ", stringify!(ma_job_queue_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job_queue_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_job_queue_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue_config),
        "::",
        stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue_config),
        "::",
        stringify!(capacity)
        )
    );
}
extern "C" {
    pub fn ma_job_queue_config_init(flags: ma_uint32, capacity: ma_uint32) -> ma_job_queue_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_job_queue {
    pub flags: ma_uint32,
    pub capacity: ma_uint32,
    pub head: ma_uint64,
    pub tail: ma_uint64,
    pub sem: ma_semaphore,
    pub allocator: ma_slot_allocator,
    pub pJobs: *mut ma_job,
    pub lock: ma_spinlock,
    pub _pHeap: *mut ::std::os::raw::c_void,
    pub _ownsHeap: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_job_queue() {
    const UNINIT: ::std::mem::MaybeUninit<ma_job_queue> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_job_queue>(),
        104usize,
        concat!("Size of: ", stringify!(ma_job_queue))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_job_queue>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_job_queue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue),
        "::",
        stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue),
        "::",
        stringify!(capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue),
        "::",
        stringify!(head)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tail) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue),
        "::",
        stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sem) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue),
        "::",
        stringify!(sem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocator) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue),
        "::",
        stringify!(allocator)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pJobs) as usize - ptr as usize },
        72usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue),
        "::",
        stringify!(pJobs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        80usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue),
        "::",
        stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pHeap) as usize - ptr as usize },
        88usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue),
        "::",
        stringify!(_pHeap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ownsHeap) as usize - ptr as usize },
        96usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_job_queue),
        "::",
        stringify!(_ownsHeap)
        )
    );
}
extern "C" {
    pub fn ma_job_queue_get_heap_size(
        pConfig: *const ma_job_queue_config,
        pHeapSizeInBytes: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_job_queue_init_preallocated(
        pConfig: *const ma_job_queue_config,
        pHeap: *mut ::std::os::raw::c_void,
        pQueue: *mut ma_job_queue,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_job_queue_init(
        pConfig: *const ma_job_queue_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pQueue: *mut ma_job_queue,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_job_queue_uninit(
        pQueue: *mut ma_job_queue,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_job_queue_post(pQueue: *mut ma_job_queue, pJob: *const ma_job) -> ma_result;
}
extern "C" {
    pub fn ma_job_queue_next(pQueue: *mut ma_job_queue, pJob: *mut ma_job) -> ma_result;
}
pub const ma_device_state_ma_device_state_uninitialized: ma_device_state = 0;
pub const ma_device_state_ma_device_state_stopped: ma_device_state = 1;
pub const ma_device_state_ma_device_state_started: ma_device_state = 2;
pub const ma_device_state_ma_device_state_starting: ma_device_state = 3;
pub const ma_device_state_ma_device_state_stopping: ma_device_state = 4;
pub type ma_device_state = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_IMMNotificationClient {
    pub lpVtbl: *mut ::std::os::raw::c_void,
    pub counter: ma_uint32,
    pub pDevice: *mut ma_device,
}
#[test]
fn bindgen_test_layout_ma_IMMNotificationClient() {
    const UNINIT: ::std::mem::MaybeUninit<ma_IMMNotificationClient> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_IMMNotificationClient>(),
        24usize,
        concat!("Size of: ", stringify!(ma_IMMNotificationClient))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_IMMNotificationClient>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_IMMNotificationClient))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpVtbl) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_IMMNotificationClient),
        "::",
        stringify!(lpVtbl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counter) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_IMMNotificationClient),
        "::",
        stringify!(counter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDevice) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_IMMNotificationClient),
        "::",
        stringify!(pDevice)
        )
    );
}
pub const ma_backend_ma_backend_wasapi: ma_backend = 0;
pub const ma_backend_ma_backend_dsound: ma_backend = 1;
pub const ma_backend_ma_backend_winmm: ma_backend = 2;
pub const ma_backend_ma_backend_coreaudio: ma_backend = 3;
pub const ma_backend_ma_backend_sndio: ma_backend = 4;
pub const ma_backend_ma_backend_audio4: ma_backend = 5;
pub const ma_backend_ma_backend_oss: ma_backend = 6;
pub const ma_backend_ma_backend_pulseaudio: ma_backend = 7;
pub const ma_backend_ma_backend_alsa: ma_backend = 8;
pub const ma_backend_ma_backend_jack: ma_backend = 9;
pub const ma_backend_ma_backend_aaudio: ma_backend = 10;
pub const ma_backend_ma_backend_opensl: ma_backend = 11;
pub const ma_backend_ma_backend_webaudio: ma_backend = 12;
pub const ma_backend_ma_backend_custom: ma_backend = 13;
pub const ma_backend_ma_backend_null: ma_backend = 14;
pub type ma_backend = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_job_thread_config {
    pub noThread: ma_bool32,
    pub jobQueueCapacity: ma_uint32,
    pub jobQueueFlags: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_device_job_thread_config() {
    const UNINIT: ::std::mem::MaybeUninit<ma_device_job_thread_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_device_job_thread_config>(),
        12usize,
        concat!("Size of: ", stringify!(ma_device_job_thread_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_job_thread_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_job_thread_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).noThread) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_job_thread_config),
        "::",
        stringify!(noThread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jobQueueCapacity) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_job_thread_config),
        "::",
        stringify!(jobQueueCapacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jobQueueFlags) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_job_thread_config),
        "::",
        stringify!(jobQueueFlags)
        )
    );
}
extern "C" {
    pub fn ma_device_job_thread_config_init() -> ma_device_job_thread_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_job_thread {
    pub thread: ma_thread,
    pub jobQueue: ma_job_queue,
    pub _hasThread: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_device_job_thread() {
    const UNINIT: ::std::mem::MaybeUninit<ma_device_job_thread> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_device_job_thread>(),
        120usize,
        concat!("Size of: ", stringify!(ma_device_job_thread))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_job_thread>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_job_thread))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_job_thread),
        "::",
        stringify!(thread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jobQueue) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_job_thread),
        "::",
        stringify!(jobQueue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._hasThread) as usize - ptr as usize },
        112usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_job_thread),
        "::",
        stringify!(_hasThread)
        )
    );
}
extern "C" {
    pub fn ma_device_job_thread_init(
        pConfig: *const ma_device_job_thread_config,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pJobThread: *mut ma_device_job_thread,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_device_job_thread_uninit(
        pJobThread: *mut ma_device_job_thread,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_device_job_thread_post(
        pJobThread: *mut ma_device_job_thread,
        pJob: *const ma_job,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_device_job_thread_next(
        pJobThread: *mut ma_device_job_thread,
        pJob: *mut ma_job,
    ) -> ma_result;
}
pub const ma_device_notification_type_ma_device_notification_type_started:
ma_device_notification_type = 0;
pub const ma_device_notification_type_ma_device_notification_type_stopped:
ma_device_notification_type = 1;
pub const ma_device_notification_type_ma_device_notification_type_rerouted:
ma_device_notification_type = 2;
pub const ma_device_notification_type_ma_device_notification_type_interruption_began:
ma_device_notification_type = 3;
pub const ma_device_notification_type_ma_device_notification_type_interruption_ended:
ma_device_notification_type = 4;
pub type ma_device_notification_type = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_device_notification {
    pub pDevice: *mut ma_device,
    pub type_: ma_device_notification_type,
    pub data: ma_device_notification__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_device_notification__bindgen_ty_1 {
    pub started: ma_device_notification__bindgen_ty_1__bindgen_ty_1,
    pub stopped: ma_device_notification__bindgen_ty_1__bindgen_ty_2,
    pub rerouted: ma_device_notification__bindgen_ty_1__bindgen_ty_3,
    pub interruption: ma_device_notification__bindgen_ty_1__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_notification__bindgen_ty_1__bindgen_ty_1 {
    pub _unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ma_device_notification__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_device_notification__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_device_notification__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
        "Size of: ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_notification__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
        "Alignment of ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_1),
        "::",
        stringify!(_unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_notification__bindgen_ty_1__bindgen_ty_2 {
    pub _unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ma_device_notification__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<ma_device_notification__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_device_notification__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
        "Size of: ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_notification__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
        "Alignment of ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_2),
        "::",
        stringify!(_unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_notification__bindgen_ty_1__bindgen_ty_3 {
    pub _unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ma_device_notification__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<ma_device_notification__bindgen_ty_1__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_device_notification__bindgen_ty_1__bindgen_ty_3>(),
        4usize,
        concat!(
        "Size of: ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_notification__bindgen_ty_1__bindgen_ty_3>(),
        4usize,
        concat!(
        "Alignment of ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_3),
        "::",
        stringify!(_unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_notification__bindgen_ty_1__bindgen_ty_4 {
    pub _unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ma_device_notification__bindgen_ty_1__bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<ma_device_notification__bindgen_ty_1__bindgen_ty_4> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_device_notification__bindgen_ty_1__bindgen_ty_4>(),
        4usize,
        concat!(
        "Size of: ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_notification__bindgen_ty_1__bindgen_ty_4>(),
        4usize,
        concat!(
        "Alignment of ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_notification__bindgen_ty_1__bindgen_ty_4),
        "::",
        stringify!(_unused)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_device_notification__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_device_notification__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_device_notification__bindgen_ty_1>(),
        4usize,
        concat!(
        "Size of: ",
        stringify!(ma_device_notification__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_notification__bindgen_ty_1>(),
        4usize,
        concat!(
        "Alignment of ",
        stringify!(ma_device_notification__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).started) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_notification__bindgen_ty_1),
        "::",
        stringify!(started)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stopped) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_notification__bindgen_ty_1),
        "::",
        stringify!(stopped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rerouted) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_notification__bindgen_ty_1),
        "::",
        stringify!(rerouted)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interruption) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_notification__bindgen_ty_1),
        "::",
        stringify!(interruption)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_device_notification() {
    const UNINIT: ::std::mem::MaybeUninit<ma_device_notification> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_device_notification>(),
        16usize,
        concat!("Size of: ", stringify!(ma_device_notification))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_notification>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_notification))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDevice) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_notification),
        "::",
        stringify!(pDevice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_notification),
        "::",
        stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_notification),
        "::",
        stringify!(data)
        )
    );
}
pub type ma_device_notification_proc =
::std::option::Option<unsafe extern "C" fn(pNotification: *const ma_device_notification)>;
pub type ma_device_data_proc = ::std::option::Option<
    unsafe extern "C" fn(
        pDevice: *mut ma_device,
        pOutput: *mut ::std::os::raw::c_void,
        pInput: *const ::std::os::raw::c_void,
        frameCount: ma_uint32,
    ),
>;
pub type ma_stop_proc = ::std::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device)>;
pub const ma_device_type_ma_device_type_playback: ma_device_type = 1;
pub const ma_device_type_ma_device_type_capture: ma_device_type = 2;
pub const ma_device_type_ma_device_type_duplex: ma_device_type = 3;
pub const ma_device_type_ma_device_type_loopback: ma_device_type = 4;
pub type ma_device_type = ::std::os::raw::c_int;
pub const ma_share_mode_ma_share_mode_shared: ma_share_mode = 0;
pub const ma_share_mode_ma_share_mode_exclusive: ma_share_mode = 1;
pub type ma_share_mode = ::std::os::raw::c_int;
pub const ma_ios_session_category_ma_ios_session_category_default: ma_ios_session_category = 0;
pub const ma_ios_session_category_ma_ios_session_category_none: ma_ios_session_category = 1;
pub const ma_ios_session_category_ma_ios_session_category_ambient: ma_ios_session_category = 2;
pub const ma_ios_session_category_ma_ios_session_category_solo_ambient: ma_ios_session_category = 3;
pub const ma_ios_session_category_ma_ios_session_category_playback: ma_ios_session_category = 4;
pub const ma_ios_session_category_ma_ios_session_category_record: ma_ios_session_category = 5;
pub const ma_ios_session_category_ma_ios_session_category_play_and_record: ma_ios_session_category =
    6;
pub const ma_ios_session_category_ma_ios_session_category_multi_route: ma_ios_session_category = 7;
pub type ma_ios_session_category = ::std::os::raw::c_int;
pub const ma_ios_session_category_option_ma_ios_session_category_option_mix_with_others:
ma_ios_session_category_option = 1;
pub const ma_ios_session_category_option_ma_ios_session_category_option_duck_others:
ma_ios_session_category_option = 2;
pub const ma_ios_session_category_option_ma_ios_session_category_option_allow_bluetooth:
ma_ios_session_category_option = 4;
pub const ma_ios_session_category_option_ma_ios_session_category_option_default_to_speaker:
ma_ios_session_category_option = 8;
pub const ma_ios_session_category_option_ma_ios_session_category_option_interrupt_spoken_audio_and_mix_with_others : ma_ios_session_category_option = 17 ;
pub const ma_ios_session_category_option_ma_ios_session_category_option_allow_bluetooth_a2dp:
ma_ios_session_category_option = 32;
pub const ma_ios_session_category_option_ma_ios_session_category_option_allow_air_play:
ma_ios_session_category_option = 64;
pub type ma_ios_session_category_option = ::std::os::raw::c_int;
pub const ma_opensl_stream_type_ma_opensl_stream_type_default: ma_opensl_stream_type = 0;
pub const ma_opensl_stream_type_ma_opensl_stream_type_voice: ma_opensl_stream_type = 1;
pub const ma_opensl_stream_type_ma_opensl_stream_type_system: ma_opensl_stream_type = 2;
pub const ma_opensl_stream_type_ma_opensl_stream_type_ring: ma_opensl_stream_type = 3;
pub const ma_opensl_stream_type_ma_opensl_stream_type_media: ma_opensl_stream_type = 4;
pub const ma_opensl_stream_type_ma_opensl_stream_type_alarm: ma_opensl_stream_type = 5;
pub const ma_opensl_stream_type_ma_opensl_stream_type_notification: ma_opensl_stream_type = 6;
pub type ma_opensl_stream_type = ::std::os::raw::c_int;
pub const ma_opensl_recording_preset_ma_opensl_recording_preset_default:
ma_opensl_recording_preset = 0;
pub const ma_opensl_recording_preset_ma_opensl_recording_preset_generic:
ma_opensl_recording_preset = 1;
pub const ma_opensl_recording_preset_ma_opensl_recording_preset_camcorder:
ma_opensl_recording_preset = 2;
pub const ma_opensl_recording_preset_ma_opensl_recording_preset_voice_recognition:
ma_opensl_recording_preset = 3;
pub const ma_opensl_recording_preset_ma_opensl_recording_preset_voice_communication:
ma_opensl_recording_preset = 4;
pub const ma_opensl_recording_preset_ma_opensl_recording_preset_voice_unprocessed:
ma_opensl_recording_preset = 5;
pub type ma_opensl_recording_preset = ::std::os::raw::c_int;
pub const ma_wasapi_usage_ma_wasapi_usage_default: ma_wasapi_usage = 0;
pub const ma_wasapi_usage_ma_wasapi_usage_games: ma_wasapi_usage = 1;
pub const ma_wasapi_usage_ma_wasapi_usage_pro_audio: ma_wasapi_usage = 2;
pub type ma_wasapi_usage = ::std::os::raw::c_int;
pub const ma_aaudio_usage_ma_aaudio_usage_default: ma_aaudio_usage = 0;
pub const ma_aaudio_usage_ma_aaudio_usage_media: ma_aaudio_usage = 1;
pub const ma_aaudio_usage_ma_aaudio_usage_voice_communication: ma_aaudio_usage = 2;
pub const ma_aaudio_usage_ma_aaudio_usage_voice_communication_signalling: ma_aaudio_usage = 3;
pub const ma_aaudio_usage_ma_aaudio_usage_alarm: ma_aaudio_usage = 4;
pub const ma_aaudio_usage_ma_aaudio_usage_notification: ma_aaudio_usage = 5;
pub const ma_aaudio_usage_ma_aaudio_usage_notification_ringtone: ma_aaudio_usage = 6;
pub const ma_aaudio_usage_ma_aaudio_usage_notification_event: ma_aaudio_usage = 7;
pub const ma_aaudio_usage_ma_aaudio_usage_assistance_accessibility: ma_aaudio_usage = 8;
pub const ma_aaudio_usage_ma_aaudio_usage_assistance_navigation_guidance: ma_aaudio_usage = 9;
pub const ma_aaudio_usage_ma_aaudio_usage_assistance_sonification: ma_aaudio_usage = 10;
pub const ma_aaudio_usage_ma_aaudio_usage_game: ma_aaudio_usage = 11;
pub const ma_aaudio_usage_ma_aaudio_usage_assitant: ma_aaudio_usage = 12;
pub const ma_aaudio_usage_ma_aaudio_usage_emergency: ma_aaudio_usage = 13;
pub const ma_aaudio_usage_ma_aaudio_usage_safety: ma_aaudio_usage = 14;
pub const ma_aaudio_usage_ma_aaudio_usage_vehicle_status: ma_aaudio_usage = 15;
pub const ma_aaudio_usage_ma_aaudio_usage_announcement: ma_aaudio_usage = 16;
pub type ma_aaudio_usage = ::std::os::raw::c_int;
pub const ma_aaudio_content_type_ma_aaudio_content_type_default: ma_aaudio_content_type = 0;
pub const ma_aaudio_content_type_ma_aaudio_content_type_speech: ma_aaudio_content_type = 1;
pub const ma_aaudio_content_type_ma_aaudio_content_type_music: ma_aaudio_content_type = 2;
pub const ma_aaudio_content_type_ma_aaudio_content_type_movie: ma_aaudio_content_type = 3;
pub const ma_aaudio_content_type_ma_aaudio_content_type_sonification: ma_aaudio_content_type = 4;
pub type ma_aaudio_content_type = ::std::os::raw::c_int;
pub const ma_aaudio_input_preset_ma_aaudio_input_preset_default: ma_aaudio_input_preset = 0;
pub const ma_aaudio_input_preset_ma_aaudio_input_preset_generic: ma_aaudio_input_preset = 1;
pub const ma_aaudio_input_preset_ma_aaudio_input_preset_camcorder: ma_aaudio_input_preset = 2;
pub const ma_aaudio_input_preset_ma_aaudio_input_preset_voice_recognition: ma_aaudio_input_preset =
    3;
pub const ma_aaudio_input_preset_ma_aaudio_input_preset_voice_communication:
ma_aaudio_input_preset = 4;
pub const ma_aaudio_input_preset_ma_aaudio_input_preset_unprocessed: ma_aaudio_input_preset = 5;
pub const ma_aaudio_input_preset_ma_aaudio_input_preset_voice_performance: ma_aaudio_input_preset =
    6;
pub type ma_aaudio_input_preset = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_timer {
    pub counter: ma_int64,
    pub counterD: f64,
}
#[test]
fn bindgen_test_layout_ma_timer() {
    const UNINIT: ::std::mem::MaybeUninit<ma_timer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_timer>(),
        8usize,
        concat!("Size of: ", stringify!(ma_timer))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_timer>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_timer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counter) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_timer),
        "::",
        stringify!(counter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counterD) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_timer),
        "::",
        stringify!(counterD)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_device_id {
    pub wasapi: [wchar_t; 64usize],
    pub dsound: [ma_uint8; 16usize],
    pub winmm: ma_uint32,
    pub alsa: [::std::os::raw::c_char; 256usize],
    pub pulse: [::std::os::raw::c_char; 256usize],
    pub jack: ::std::os::raw::c_int,
    pub coreaudio: [::std::os::raw::c_char; 256usize],
    pub sndio: [::std::os::raw::c_char; 256usize],
    pub audio4: [::std::os::raw::c_char; 256usize],
    pub oss: [::std::os::raw::c_char; 64usize],
    pub aaudio: ma_int32,
    pub opensl: ma_uint32,
    pub webaudio: [::std::os::raw::c_char; 32usize],
    pub custom: ma_device_id__bindgen_ty_1,
    pub nullbackend: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_device_id__bindgen_ty_1 {
    pub i: ::std::os::raw::c_int,
    pub s: [::std::os::raw::c_char; 256usize],
    pub p: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ma_device_id__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ma_device_id__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ma_device_id__bindgen_ty_1>(),
        256usize,
        concat!("Size of: ", stringify!(ma_device_id__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_id__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_id__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_id__bindgen_ty_1),
        "::",
        stringify!(i)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(ma_device_id__bindgen_ty_1),
        "::",
        stringify!(s)
        )
    );
    assert_eq!(
